content/emacs/modes/tramp-mode.org
# -*- coding:utf-8-*-
#+TITLE: TRAMP
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com



《[[https://www.gnu.org/software/tramp/][TRAMP 2.4.4 User Manual]]》是 TRAMP 2.4.4 的文档，tramp 是 Emacs 的远程文件编辑软件包。

TRAMP 代表“Transparent Remote (file) Access, Multiple Protocol”。该软件包提供了远程文件编辑，类似于 Ange FTP。

区别在于，Ange FTP 使用 FTP 在本地和远程主机之间传输文件，而 TRAMP 使用 rsh 和 rcp 或其他类似工作的程序（例如 ssh / scp）的组合。

* An overview of TRAMP

  TRAMP 用于 Emacs 中透明地访问远程文件。TRAMP 可以为远程文件提供简单，方便且一致的界面，就好像它们是本地文件一样。 TRAMP 的透明性扩展到编辑，版本控制和导航。

  TRAMP 可以使用多种访问方法（例如 rsh，rlogin，telnet 和相关程序）访问远程主机。如果这些程序可以成功传递 ASCII 字符，则 TRAMP 可以使用它们。 TRAMP 不需要也不要求 8 位纯净连接。

  TRAMP 最常见的访问方法是 ssh，一种比 ftp 和其他旧访问方法更安全的替代方法。

  MS Windows 操作系统上的 TRAMP 与 PuTTY 软件包集成，并使用 plink 程序。

  TRAMP 大多数情况下使用连接程序在后台透明地运行。只要这些程序启用远程登录并可以使用终端，TRAMP 便可以对其进行调整以实现无缝和透明的访问。

  TRAMP 临时将远程文件的内容传输到本地主机进行编辑和相关操作。TRAMP 还可以使用标准 Emacs 接口在主机之间传输文件，这是在 Emacs 中直接集成 TRAMP 的好处。

  TRAMP 可以使用很多主机程序传输远程文件，例如 rcp，scp，rsync 或 pscp（在 MS Windows 下）。TRAMP 提供了指定这些程序的简便方法，并可为特定文件，主机或访问方法进行自定义。

  为更快传输小文件，TRAMP 使用 mimencode 或 uuencode 直接通过 shell 支持编码传输，前提是远程主机上提供了此类工具。

** TRAMP behind the scenes
   通过 TRAMP 访问远程文件需要一系列操作，其中许多操作对用户是透明的。然而，某些操作可能需要用户响应（例如输入密码或填写文件名）。此处介绍了打开远程主机上文件的一种典型场景，以说明所涉及的步骤：

   =C-x C-f= 启动查找文件，输入文件名的 TRAMP 部分，然后点击 TAB 进行补全。如果这是第一次连接到该主机，执行以下操作：

   + TRAMP 调用 ‘telnet host’ 或 ‘rsh host -l user’，建立外部过程以连接到远程主机。 TRAMP 通过 Emacs 缓冲区与进程进行通信，该缓冲区还显示远程主机的输出。
   + 远程主机可能会提示在缓冲区中输入登录名（例如，用于 telnet）。另一方面，如果登录名包含在文件名部分中，则 TRAMP 发送登录名后跟换行符。
   + 然后，远程主机可能提示输入密码或密码短语（用于 rsh 或用于 telnet）。TRAMP 在 mini buffer 中显示密码提示。TRAMP 然后将输入的内容发送到远程主机，然后是换行符。
   + 现在，TRAMP 等待 shell 提示或失败的登录消息。

     如果 TRAMP 在超时时间段（例如一分钟）内未收到任何消息，则 TRAMP 会以一条错误消息作为响应，提示您找不到远程 Shell 提示符。如果来自远程主机的任何消息，TRAMP 会在缓冲区中显示它们。

     对于来自远程主机的任何“登录失败”消息，TRAMP 会中止登录尝试，并再次重复登录步骤。

   + 成功登录后，TRAMP 会从远程主机识别出 shell 提示，TRAMP 通过关闭回显，设置 shell 提示和其他事务来准备 shell 环境。

     请注意，对于远程 shell，TRAMP 调用 =/bin/sh= 。远程主机必须识别 =exec /bin/sh= 并执行适当的 shell。此 shell 必须支持 Bourne shell 语法。

   + TRAMP 执行 cd 和 ls 命令以查找远程主机上存在哪些文件。TRAMP 有时使用带有 [[https://en.wikipedia.org/wiki/Glob_(programming)][globbing]] 的 echo。TRAMP 通过 test 检查文件或目录是否可写。在每个命令之后，TRAMP 解析远程主机的输出以完成下一个操作。

   + 远程文件名完成后，TRAMP 从远程主机传输文件内容。

     对于内联传输，TRAMP 发送命令，例如 'mimencode -b /path/to /remote/file'，等到输出在缓冲区中累积后，对该输出进行解码以产生文件的内容。

     对于外部传输，TRAMP 发送如下命令：
     #+BEGIN_SRC sh
rcp user@host:/path/to/remote/file /tmp/tramp.4711
     #+END_SRC

     TRAMP 将本地临时文件 =/tmp/tramp.4711= 读入缓冲区，然后删除临时文件。

   + 正常编辑，修改，更改缓冲区内容，然后使用 =C-x C-s= 保存缓冲区。

   + TRAMP 使用适当的内联或外部程序以与过程相反的方式将缓冲区内容传输到远程主机。

   我希望这为您提供了使用 TRAMP 打开文件时幕后发生的事情的基本概述。

* Obtaining TRAMP
  TRAMP 作为 Emacs 的一部分包含在内（自 Emacs 22.1 起）。

* Installing TRAMP into Emacs
* Short introduction how to use TRAMP
  TRAMP 通过远程组件扩展 Emacs 文件名语法。远程文件名始终看起来像 =/method:user@host:/path/to/file= 。

  使用远程文件的方法与普通文件相同，这意味着您可以通过 =C-x C-f /method:user@host:/path/to/file RET= 方法打开文件或目录，编辑文件并保存。您还可以在文件操作中将本地文件和远程文件与两个参数混合使用，比如 copy-file 和 rename-file。最后，如果缓冲区具有远程默认目录，甚至可以在该缓冲区调用远程主机上的进程。

** File name syntax
   远程文件名由方法，用户和主机部分作为前缀。所有这些以及本地文件名部分都是可选的，如果缺少部分，则使用默认值。空本地文件名部分的默认值是远程用户的主目录。因此，最短的远程文件名是 =/-::= 。出于语法原因，默认主机使用“-”符号表示。

   方法部分描述了用于访问远程主机的连接方法，请参见下文。

   方法（method）部分描述了用于到达远程主机的连接方法，请参见下文。

   用户（user）部分是用于访问远程主机的用户名。对于 smb 方法，这可能还需要域名，在这种情况下，写作 =user%domain= 。

   主机（host）部分必须是可在本地主机上解析的主机名。它可以是短主机名，完全限定的域名，IPv4 或 IPv6 地址，文件名语法。某些连接方法也支持使用端口的表示法，在这种情况下，它被写为 =host#port= 。

** Using ssh and plink
   如果本地主机运行 SSH 客户端，并且远程主机运行 SSH 服务器，则最简单的远程文件名是 =/ssh:user@host:/path/to/file= 。远程文件名 =/ssh::= 本地主机上打开与当前主机的远程连接，并经常用于测试 TRAMP。

   在 MS Windows 上，PuTTY 通常用作 SSH 客户端。其 plink 方法可用于打开与运行 ssh 服务器的远程主机的连接: =/plink:user@host:/path/to/file= .

** Using su, sudo and sg
   有时，必须以不同的权限在本地主机上工作。为此，可以使用 su 或 sudo 连接方法。两种方法都使用 “root” 作为默认用户名，并使用 =(system-name)= 的返回值作为默认主机名。因此，将文件打开为 =/sudo::/path/to/file= 很方便。

   方法 sg 代表 “switch group”; 必须在此处将更改的组名与用户名相同。默认主机名相同。

