content/emacs/modes/tramp-mode.org
** 外部方法
   外部方法通过远程 shell 连接执行某些操作，同时将文件传输委派给外部传输程序，从而通过多个通道进行操作。

   外部方法节省了内联方法的编码和解码开销。

   由于外部方法具有打开新通道的开销，因此小于 tramp-copy-size-limit 的文件仍使用内联方法。

   + rcp

     此方法使用 rsh 和 rcp 命令连接到远程主机并传输文件。这是最快的访问方法。

     替代方法 remcp 使用 remsh 和 rcp 命令。

   + scp

     使用 ssh 连接和 scp 进行传输的组合是最安全的。虽然性能良好，但它比适合较小文件的内联方法慢。虽然没有内联方法的编码和解码开销，但 scp 的加密握手抵消了这些速度增益。

     基于 ssh 的方法支持 '-p' 功能来指定端口号。例如，=host＃42= 将参数列表中的 “-p 42” 传递给 ssh，将参数列表中的 “-P 42” 传递给 scp。

   + rsync

     ssh 命令与 rsync 命令一起连接到传输类似于 scp 方法。

     传输两个主机上存在的文件时，rsync 比 scp 执行得更好。但是，如果文件仅存在于连接的一侧，则会丢失此优点。

     此方法支持 '-p' 参数。

   + scpx

     scpx 有助于避免登录 shell 问题。它在性能上与 scp 相似。scpx 使用' ssh -t -t host -l user /bin/sh' 来打开连接。

     当 ssh 触发有关分配伪 tty 的错误时，scpx 对 MS Windows 用户很有用。这是因为缺少 shell 提示使 TRAMP 出错。

     此方法支持 '-p' 参数。

   + pscp
   + psftp

     这些方法类似于 scp 或 sftp，但是它们使用 plink 命令连接到远程主机，并且它们使用 pscp 或 psftp 来传输文件。这些程序是 PuTTY 的一部分，PuTTY 是 MS Windows 的 SSH 实现。

     勾选该会话的 “如果可能，共享 SSH 连接” 控件。

     这些方法支持 '-P' 参数。

   + fcp

     此方法类似于 scp，但使用 fsh 连接和 fcp 传输文件。fsh/fcp 是 ssh 的前端，通过提交几个命令重用 ssh 会话。这可以避免由于 scp 的安全连接而导致的启动开销。内联方法具有类似的好处。

     用于此连接的命令是： =fsh host -l user /bin/sh -i=

     fsh 没有内联方法，因为它提供的多路复用对 TRAMP 没用。fsh 连接到远程主机，TRAMP 只保持该连接打开。

   + nc

     使用 telnet 连接和 nc 传输文件有时是唯一适合访问路由器或 NAS 主机的组合。这些设备严重限制了本地 shell，例如 busybox，并且没有任何其他编码或解码程序。

   + sudoedit

     sudoedit 方法允许作为本地主机上的其他用户编辑文件。可以将此视为 TRAMP 对 sudoedit 的实现。与 sudo 方法相反，所有魔术文件名函数都由单个 =sudo ...= 命令实现。目的是使编辑这样的文件尽可能安全；必须没有在 Emacs 后台运行的会话可能会从 Emacs 内部受到攻击。

     因此，未实施外部实现。

     此类远程文件名的主机名必须代表本地主机。由于默认值已经正确，因此建议不要在远程文件名中使用任何主机名，例如 =/sudoedit::/path/to/file= 或者 =/sudoedit:user@:/path/to/file= 。

     与 sudo 方法一样，sudoedit 密码在预定义超时后到期。

   + ftp
	 当 TRAMP 使用 ftp 时，它会将请求转发给 Ange FTP 指定的任何 ftp 程序。该外部程序必须能够处理来自 TRAMP 的请求。

   + smb

     此非本机 TRAMP 方法通过服务器消息块（SMB）网络协议连接到通常基于 Samba 的文件服务器或 MS Windows。

     在使用 TRAMP 时，使用 smbclient 需要一些调整：

     localname 中的第一个目录必须是远程主机上的共享名称。

     由于某些 SMB 共享名称以 $ 字符结尾，因此 TRAMP 在指定这些共享时必须使用 $$ 以避免环境变量替换。

     当 TRAMP 不是特定于共享名称或使用通用远程目录 / 时，smbclient 返回所有可用共享。

     由于 SMB 身份验证基于每个 SMB 共享，​​因此即使访问同一 SMB 主机上的其他共享，TRAMP 也会提示输入密码。密码处理可以抑制此提示。

     为了适应 MS Windows 授权所需的用户名/域名语法，TRAMP 提供了用户％域格式的扩展语法（其中 user 是用户名，％是百分号，domain 是 MS Windows 域名）。一个例子：
     #+BEGIN_EXAMPLE
/smb:daniel%BIZARRE@melancholia:/daniel$$/.emacs
     #+END_EXAMPLE

     用户 daniel 作为域用户连接到 MS Windows 域 BIZARRE 中的 SMB 主机 melancholia，以编辑位于主目录中的. emacs（共享 daniel$）。

     或者，对于本地 WINS 用户（而不是域用户），使用 UPPERCASE 中的本地主机名替换域名，如下所示：
     #+BEGIN_EXAMPLE
/smb:daniel%MELANCHOLIA@melancholia:/daniel$$/.emacs
     #+END_EXAMPLE

     用户 daniel 以本地用户身份连接到本地域 MELANCHOLIA 中的 SMB 主机 melancholia，以编辑位于主目录中的. emacs（共享 daniel $）。

     域名和用户名对于 smbclient 身份验证是可选的。 如果未指定用户名，则 smbclient 将使用匿名用户（不提示输入密码）。 此行为与其他 TRAMP 方法不同，其中本地用户名被替换。

     如果 Emacs 在 MS Windows 中的本地用户身份验证上下文中运行，则 smb 方法不可用。 但是，此类用户仍然可以使用 UNC 文件名而不是 TRAMP 访问远程文件：
     #+BEGIN_EXAMPLE
//melancholia/daniel$$/.emacs
     #+END_EXAMPLE

     UNC 文件名规范不允许像 smbclient 那样为身份验证指定不同的用户名。

   + adb

     此方法使用 Android Debug Bridge 程序访问 Android 设备。必须在本地安装 Android Debug Bridge 才能使 TRAMP 正常工作。一些 GNU/Linux 发行版提供 Android Debug Bridge 安装包。或者，该程序作为 Android SDK 的一部分安装。TRAMP 通过 PATH 环境变量或用户选项 tramp-adb-program 中设置的绝对路径查找 adb 程序。

     仅当用户选项 tramp-adb-connect-if-not-connected 不为 nil 时，TRAMP 才会使用 adb 连接到 Android 设备。否则，必须在 Emacs 外部建立连接。

     当单个 Android 设备连接到 adb 时，TRAMP 不需要远程文件名的主机名部分。TRAMP 使用 =/adb::= 作为默认名称。adb devices 显示可用的主机名。

     adb 方法通常不需要用户名在 Android 设备上进行身份验证，因为它在 adbd 进程下运行。但是，当指定用户名时，TRAMP 会在语法中应用 su。当身份验证不成功时，尤其是在未 root 的 Android 设备上，TRAMP 会显示登录错误。

     对于通过 TCP/IP 连接的 Android 设备，可以使用设备＃ 42 主机名语法指定端口号，或者 TRAMP 可以使用 adb 命令中声明的默认值。端口号不适用于通过 USB 连接的 Android 设备。

   + rclone

     程序 rclone 允许访问云中的不同系统存储，请参阅https://rclone.org/ 以获取支持的系统列表。如果在 PATH 环境变量中找不到 rclone 程序，可以通过用户选项 tramp-rclone-program 告诉 Tramp 它的绝对路径。

     必须通过 Emacs 外部的 rclone config 命令配置系统存储。如果您在名称' storage'（例如）下的 rclone 中配置了存储，则可以通过远程文件名访问它
     #+BEGIN_EXAMPLE
/rclone:storage:/path/to/file
     #+END_EXAMPLE

     用户名是 rclone 配置的一部分，远程文件名中不需要。如果远程文件名中包含用户名，则会将其忽略。

     在内部，Tramp 将远程系统存储安装在位置 /tmp/tramp.rclone.storage 中，其中存储是已配置系统存储的名称。

     可以将不同 rclone 操作的可选标志作为连接属性传递，请参阅预定义的连接信息。支持的属性是 'mount-args'，'copyto-args' 和 'moveto-args'。

     通过 rclone 访问很慢。如果您有另一种访问系统存储的方法，您应该更喜欢这个。基于 GVFS 的方法，例如，方法 gdrive 和 nextcloud。

     注意：rclone 方法是实验性的，不要在生产系统中使用它！

