content/emacs/modes/tramp-mode.org
** 基于 GVFS 的 外部方法
   GVFS is the virtual file system for the GNOME Desktop, https://en.wikipedia.org/wiki/GVFS. Remote files on GVFS are mounted locally through FUSE and TRAMP uses this locally mounted directory internally.

   Emacs uses the D-Bus mechanism to communicate with GVFS. Emacs must have the message bus system, D-Bus integration active, see (dbus)D-Bus.

   + afp

     This method is for connecting to remote hosts with the Apple Filing Protocol for accessing files on macOS volumes. TRAMP access syntax requires a leading volume (share) name, for example: /afp:user@host:/volume.

   + dav
   + davs

     dav method provides access to WebDAV files and directories based on standard protocols, such as HTTP. davs does the same but with SSL encryption. Both methods support the port numbers.

     Paths being part of the WebDAV volume to be mounted by GVFS, as it is common for OwnCloud or NextCloud file names, are not supported by these methods. See method nextcloud for handling them.

   + gdrive
     Via the gdrive method it is possible to access your Google Drive online storage. User and host name of the remote file name are your email address of the Google Drive credentials, like /gdrive:john.doe@gmail.com:/. These credentials must be populated in your Online Accounts application outside Emacs.

     Since Google Drive uses cryptic blob file names internally, TRAMP works with the display-name of the files. This could produce unexpected behavior in case two files in the same directory have the same display-name, such a situation must be avoided.

   + nextcloud

     As the name indicates, the method nextcloud allows you to access OwnCloud or NextCloud hosted files and directories. Like the gdrive method, your credentials must be populated in your Online Accounts application outside Emacs. The method supports port numbers.

   + sftp

     This method uses sftp in order to securely access remote hosts. sftp is a more secure option for connecting to hosts that for security reasons refuse ssh connections.

*** User Option: tramp-gvfs-methods
    This user option is a list of external methods for GVFS. By default, this list includes afp, dav, davs, gdrive, nextcloud and sftp. Other methods to include are ftp, http, https and smb. These methods are not intended to be used directly as GVFS based method. Instead, they are added here for the benefit of Archive file names.

** 选择默认方法
   在远程文件名中，使用伪方法 =-= 指示使用默认方法。

   + User Option: tramp-default-method

     传输文件的默认方法。用户选项 tramp-default-method 设置它。TRAMP 使用此用户选项来确定没有指定远程文件名的远程文件名的默认方法。

     #+BEGIN_SRC eslip
(setq tramp-default-method "ssh")
     #+END_SRC

   + User Option: tramp-default-method-alist

     也可以通过变量 tramp-default-method-alist 针对特定的 user/host 组合设置不同的方法。

     例如，以下两行指定将 ssh 方法用于匹配 'john' 的所有用户名，并将 rsync 方法用于匹配 'lily' 的所有主机名。第三行指定在主机 'localhost' 上为用户 'root' 使用 su 方法。

     #+BEGIN_SRC elisp
(add-to-list 'tramp-default-method-alist '("" "john" "ssh"))
(add-to-list 'tramp-default-method-alist '("lily" "" "rsync"))
(add-to-list 'tramp-default-method-alist
 '("\\`localhost\\'" "\\`root\\'" "su"))
     #+END_SRC


   外部方法对大文件的性能更快。请参阅[[https://www.gnu.org/software/tramp/#Inline-methods][Inline method]]。见[[https://www.gnu.org/software/tramp/#External-methods][External methods]]。

   选择访问方法还取决于安全环境。例如，使用明文密码传输的 rsh 和 telnet 方法不适合通过 Internet 连接。安全远程连接应使用提供加密的 ssh。

*** 使用哪种方法？
    TRAMP 提供最大数量的选择以实现最大的灵活性。选择哪种方法取决于主机，客户端，网络速度和安全上下文。

    首先使用内联方法。

    对于大型文件，外部方法可能更有效，但相比大文件，大多数 TRAMP 用户更频繁地编辑小文件。

    启用压缩，tramp-inline-compress-start-size，以提高大文件的性能。

    由于 ssh 已成为最常用的远程主机访问方法，并且它具有最合理的安全协议，因此请使用 ssh 方法。用于编辑 otherhost 上的 /etc/motd 文件的典型 ssh 用法：
    #+BEGIN_EXAMPLE
C-x C-f /ssh:root@otherhost:/etc/motd RET
    #+END_EXAMPLE

    如果 ssh 由于某种原因不可用，请寻找其他明显的选项。对于 MS Windows，请尝试使用 plink 方法。对于 Kerberos，请尝试使用 krlogin。

    要将本地文件编辑为 su 或 sudo 方法，请尝试缩写 “root” 语法：
    #+BEGIN_EXAMPLE
C-x C-f /su::/etc/motd RET
    #+END_EXAMPLE

    对于编辑大文件，scp 比 ssh 快。pscp 比 plink 快。但这种速度提升并非总是如此。

** 选择默认用户
   + User Option: tramp-default-user

     TRAMP 文件名可以省略用户名部分，因为 TRAMP 用当前登录的用户名替换。但是，可以使用 tramp-default-user 覆盖此替换。例如：
     #+BEGIN_SRC elisp
(customize-set-variable 'tramp-default-user "root")
     #+END_SRC

   + User Option: tramp-default-user-alist

     tramp-default-user-alist 不是单个默认用户，而是根据访问方法或主机名组合允许多个默认用户值。alist 可以包含多个值。例如，要仅将 “john” 用作域 “somewhere.else” 的默认用户：
     #+BEGIN_SRC elisp
(add-to-list 'tramp-default-user-alist
 '("ssh" ".*\\.somewhere\\.else\\'" "john"))
     #+END_SRC

     注意：TRAMP 将覆盖 Emacs 外部配置文件中指定的任何默认用户，例如 =~/.ssh/config= 。要停止 TRAMP 应用默认值，请将相应的 alist 条目设置为 nil：
   #+BEGIN_SRC elisp
(add-to-list 'tramp-default-user-alist
 '("ssh" "\\`here\\.somewhere\\.else\\'" nil))
   #+END_SRC

   tramp-default-user-alist 中的最后一个条目应保留为 catch-all 或最常用的登录。
   #+BEGIN_SRC elisp
(add-to-list 'tramp-default-user-alist
 '(nil nil "jonas") t)
   #+END_SRC

** 选择默认主机
   + User Option: tramp-default-host

   省略主机名时，TRAMP 将其替换为 tramp-default-host 用户选项中的值。它使用 Emacs 运行的本地主机名初始化。默认方法，默认用户和默认主机可以被覆盖，如下所示：
   #+BEGIN_SRC elisp
(custom-set-variables
 '(tramp-default-method "ssh")
 '(tramp-default-user "john")
 '(tramp-default-host "target"))
   #+END_SRC

   设置了所有默认值后，‘/-::’ 将通过 ssh 将 TRAMP 连接到目标上的 John 的主目录。

   + User Option: tramp-default-host-alist

   tramp-default-host-alist 不是单个默认主机，而是根据访问方法或用户名组合允许多个默认主机值。alist 可以包含多个值。 虽然 tramp-default-host 在大多数情况下已足够，但某些方法（如 adb）需要覆盖默认值。

