content/emacs/modes/tramp-mode.org
** 使用多跳连接到远程主机
   Multi-hops 是到达防火墙后面的主机或从堡垒主机内部到达外部世界的方法。通过 multi-hops，TRAMP 可以在每一跳上通过适当的用户/主机认证来协商。到目前为止，所有方法都是单跳类型，其中连接的起点和终点没有中间检查点。

   + User Option: tramp-default-proxies-alist

   tramp-default-proxies-alist 指定要传递的代理主机。此用户选项是由 (host user proxy)组成的三元组列表。

   第一个匹配是代理主机，通过该主机传递文件名和匹配 user@host 的目标主机。host 和 user 是正则表达式或 nil，解释为始终匹配的正则表达式。

   proxy 是一个 TRAMP 文件名，其本地名称部分被忽略，方法和用户名部分是可选的。

   该方法必须是内联方法（请参阅内联方法）。如果 proxy 为 nil，则不需要额外的跃点到达 user@host。

   例如，要将主机 'bastion.your.domain' 作为用户 'bird' 传递到本地域之外的远程主机：
   #+BEGIN_SRC elisp
(add-to-list 'tramp-default-proxies-alist
 '("\\." nil "/ssh:bird@bastion.your.domain:"))
(add-to-list 'tramp-default-proxies-alist
 '("\\.your\\.domain\\'" nil nil))
   #+END_SRC

   注意：add-to-list 在列表的开头添加元素。因此，大多数相关规则必须在列表中排在最后。

   代理主机可以在 alist 中级联。如果有另一个名为 'jump.your.domain' 的主机，它是唯一允许连接到 'bastion.your.domain' 的主机，那么：
   #+BEGIN_SRC elisp
(add-to-list 'tramp-default-proxies-alist
 '("\\`bastion\\.your\\.domain\\'"
 "\\`bird\\'"
 "/ssh:jump.your.domain:"))
   #+END_SRC

   代理可以分别为主机或用户设置％ h 或％ u 模式。端口或域（如果它们是跃点文件名的一部分）对应的模式不会被扩展。

   要在域 “your.domain” 中的远程主机上以 “root” 身份登录，但是对于非本地访问禁用以 “root” 身份登录，请使用此 alist 条目：
   #+BEGIN_SRC elisp
(add-to-list 'tramp-default-proxies-alist
 '("\\.your\\.domain\\'" "\\`root\\'" "/ssh:%h:"))
   #+END_SRC

   打开 =/sudo:randomhost.your.domain= ：首先通过您的帐户名 ssh 连接到 'randomhost.your.domain'，然后在该主机上执行 =sudo -u root= 。

   上述示例中的 sudo 方法在到达主机后应用于主机而不是本地主机上是关键。因此，TRAMP 检查此类跃点的主机名是否与前一跃点的主机名匹配。

   主机，用户和代理也可以采用 Lisp list。这些 list 求值必须返回字符串或 nil。

   概括（来自前面的示例）：对于除本地主机之外的所有主机，首先通过 ssh 连接，然后应用 =sudo -u root= ：
   #+BEGIN_SRC elisp
(add-to-list 'tramp-default-proxies-alist
 '(nil "\\`root\\'" "/ssh:%h:"))
(add-to-list 'tramp-default-proxies-alist
 '((regexp-quote (system-name)) nil nil))
   #+END_SRC

   通过跳跃涉及处理受限制的 shell，例如 rbash。如果 TRAMP 被识别，那么它将仅用于代理。

   + User Option: tramp-restricted-shell-hosts-alist

   运行受限 shell 的主机的正则表达式的列表，例如 rbash。然后 TRAMP 将仅将它们用作代理。

   要从上面的示例中指定堡垒主机作为运行受限 shell：

   #+BEGIN_SRC sh
(add-to-list 'tramp-restricted-shell-hosts-alist
 "\\`bastion\\.your\\.domain\\'")
   #+END_SRC

** 通过防火墙
   有时，无法直接访问远程主机。可能会有防火墙妨碍，可以通过代理服务器穿过。

   ssh 和 PuTTY 都支持这样的代理设置，通过 CONNECT 命令使用 HTTP 隧道（符合 RFC 2616,2817 规范）。使用 HTTP 1.1 或更高版本协议的代理服务器支持此命令。

*** ssh 隧道
    使用 ssh，您可以使用 =~/.ssh/config= 中的 ProxyCommand 条目：
    #+BEGIN_EXAMPLE
Host host.other.domain
 ProxyCommand nc -X connect -x proxy.your.domain:3128 %h %p
    #+END_EXAMPLE
    nc 是 BSD 的 netcat 程序，它建立 HTTP 隧道。也可以使用具有这种功能的任何其他程序。

    在该示例中，打开 =/ssh:host.your.domain= ：在端口 3128 上通过 HTTP 代理服务器 “proxy.your.domain”。

*** Tunneling with PuTTY
    PuTTY 不需要外部程序，内置 HTTP 隧道支持。在 PuTTY 配置程序中，为 'host.your.domain' 创建一个会话。在 “Connection/Data” 条目中，选择 HTTP 选项，并将 “proxy.your.domain” 添加为代理主机名，将 3128 添加为 “端口”。

    打开 =/plinkx:host.your.domain= ：在端口 3128 上传递 HTTP 代理服务器 'proxy.your.domain'。

** 使用非标准方法
   tramp-methods 变量目前有一个详尽的预定义方法列表。可以修改此列表的任何部分更合适的设置。请参阅该变量的 Lisp 文档，可通过 =C-h v tramp-methods RET= 访问。

   在 ELPA 档案中，有几个这样的扩展的例子。它们可以与 Emacs 的软件包管理器一起安装。这包括

   + docker-tramp

   Docker 容器的集成。通过 =/docker:user@container:/path/to/file= 访问容器：其中 'user' 是您要使用的（可选）用户，'container' 是容器的 ID 或名称。

   + kubernetes-tramp

   集成在 Kubernetes 集群中的 Docker 容器。它衍生自 'docker-tramp'。通过 =/kubectl:user@container:/path/to/file= 访问容器，'user' 和 'container' 与 'docker-tramp' 中的含义相同。

   + lxc-tramp

   LXC 容器的集成。通过 =/lxc:container:/path/to/file= 访问容器，'container' 与 'docker-tramp' 中的含义相同。忽略 “user” 规范。

   + lxd-tramp

   LXD 容器的集成。通过 =/lxd:user@container:/path/to/file= 访问容器，'user' 和 'container' 与 'docker-tramp' 中的含义相同。

   + magit-tramp

   使用 magit 浏览 git 存储库。通过 =/git:rev@root-dir:/path/to/file= 访问版本化文件。 'rev' 是一个 git 版本，'root-dir' 是根目录的虚拟主机名，在 magit-tramp-hosts-alist 中指定。

   + tramp-hdfs

   访问 hadoop /hdfs 文件系统。通过 =/hdfs:user@node:/path/to/file= 访问文件，其中 'user' 是您要使用的用户，'node' 是 hadoop 服务器的名称。

   + vagrant-tramp

   访问 vagrant box 的便捷方法。它经常用在像 =/vagrant:box|sudo:box:/path/to/file=这样的多跳文件名中，其中 'box' 是 vagrant 的名称。

** 选择配置文件以补全用户/主机名
   tramp-completion-function-alist 使用预定义文件来补全用户名和主机名（请参阅文件名完成）。 对于每个方法，它保留一组配置文件和一个可以解析该文件的函数。tramp-completion-function-alist 中的每个条目都是形式（方法 pair1 pair2 ...）。

   每对由（函数文件）组成。function 负责从文件中提取用户名和主机名以完成。有两个函数可以访问这个变量：

   + Function: tramp-get-completion-function method

   此函数返回方法的补全函数列表。

   #+BEGIN_SRC elisp
(tramp-get-completion-function "rsh")
   #+END_SRC

   #+BEGIN_EXAMPLE
 ⇒ ((tramp-parse-rhosts "/etc/hosts.equiv")
 (tramp-parse-rhosts "~/.rhosts"))
   #+END_EXAMPLE

   + Function: tramp-set-completion-function method function-list

   此函数将 function-list 设置为方法的完成函数列表。

   #+BEGIN_SRC elisp
(tramp-set-completion-function "ssh"
							 '((tramp-parse-sconfig "/etc/ssh_config")
								 (tramp-parse-sconfig "~/.ssh/config")))

   #+END_SRC

   #+BEGIN_EXAMPLE
⇒ ((tramp-parse-sconfig "/etc/ssh_config")
 (tramp-parse-sconfig "~/.ssh/config"))
   #+END_EXAMPLE


   下面预定的函数用来分析已经存在的配置文件：

*** tramp-parse-rhosts
    此函数解析语法等同于 =~/.rhosts= 的文件。如果指定，它将返回主机名和用户名。

*** tramp-parse-shosts
    此函数解析语法等同于 =~/.ssh/known_hosts= 的文件。由于此类文件中未指定用户名，因此只能返回主机名。

*** tramp-parse-sconfig
    此函数返回由 =~/.ssh/config= 样式文件中的主机条目定义的主机昵称。

*** tramp-parse-shostkeys
    SSH2 解析目录 =/etc/ssh2/hostkeys/*= 和 =~/ssh2/hostkeys/*= 。主机以文件名 hostkey_portnumber_host-name.pub 编码。用户名总是 nil。

*** tramp-parse-sknownhosts
    另一种 SSH2 样式解析目录， =/etc/ssh2/knownhosts/*= 和 =~/ssh2/knownhosts/*= ，在这种情况下，主机名称以文件名 host-name.algorithm.pub 编码。用户名总是 nil。

*** tramp-parse-hosts
    专用于 /etc/hosts 的主机名函数。

*** tramp-parse-passwd
    一个解析 /etc/passwd 用户名的函数。

*** tramp-parse-etc-group
    解析组名的 /etc/group 的函数。

