emacs/modes/tramp-mode.html

<div id="outline-container-org652b05a" class="outline-3">
<h3 id="org652b05a"><span class="section-number-3">5.8</span> 使用多跳连接到远程主机</h3>
<div class="outline-text-3" id="text-5-8">
<p>
Multi-hops 是到达防火墙后面的主机或从堡垒主机内部到达外部世界的方法。通过  multi-hops，TRAMP 可以在每一跳上通过适当的用户/主机认证来协商。到目前为止，所有方法都是单跳类型，其中连接的起点和终点没有中间检查点。
</p>

<ul class="org-ul">
<li><p>
User Option: tramp-default-proxies-alist
</p>

<p>
tramp-default-proxies-alist 指定要传递的代理主机。此用户选项是由 (host user proxy)组成的三元组列表。
</p>

<p>
第一个匹配是代理主机，通过该主机传递文件名和匹配 user@host 的目标主机。host 和  user 是正则表达式或  nil，解释为始终匹配的正则表达式。
</p>

<p>
proxy 是一个  TRAMP 文件名，其本地名称部分被忽略，方法和用户名部分是可选的。
</p>

<p>
该方法必须是内联方法（请参阅内联方法）。如果  proxy 为  nil，则不需要额外的跃点到达  user@host。
</p>

<p>
例如，要将主机 'bastion.your.domain' 作为用户 'bird' 传递到本地域之外的远程主机：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'tramp-default-proxies-alist
             '(<span style="color: #ff4ea3;">"\\."</span> nil <span style="color: #ff4ea3;">"/ssh:bird@bastion.your.domain:"</span>))
(add-to-list 'tramp-default-proxies-alist
             '(<span style="color: #ff4ea3;">"\\.your\\.domain\\'"</span> nil nil))
</pre>
</div>

<p>
注意：add-to-list 在列表的开头添加元素。因此，大多数相关规则必须在列表中排在最后。
</p>

<p>
代理主机可以在  alist 中级联。如果有另一个名为 'jump.your.domain' 的主机，它是唯一允许连接到 'bastion.your.domain' 的主机，那么：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'tramp-default-proxies-alist
             '(<span style="color: #ff4ea3;">"\\`</span><span style="color: #5fafd7;">bastion\\.your\\.domain\\</span><span style="color: #ff4ea3;">'"</span>
               <span style="color: #ff4ea3;">"\\`</span><span style="color: #5fafd7;">bird\\</span><span style="color: #ff4ea3;">'"</span>
               <span style="color: #ff4ea3;">"/ssh:jump.your.domain:"</span>))
</pre>
</div>

<p>
代理可以分别为主机或用户设置％ h 或％ u 模式。端口或域（如果它们是跃点文件名的一部分）对应的模式不会被扩展。
</p>

<p>
要在域 “your.domain” 中的远程主机上以 “root” 身份登录，但是对于非本地访问禁用以 “root” 身份登录，请使用此  alist 条目：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'tramp-default-proxies-alist
   '(<span style="color: #ff4ea3;">"\\.your\\.domain\\'"</span> <span style="color: #ff4ea3;">"\\`</span><span style="color: #5fafd7;">root\\</span><span style="color: #ff4ea3;">'"</span> <span style="color: #ff4ea3;">"/ssh:%h:"</span>))
</pre>
</div>

<p>
打开 <code>/sudo:randomhost.your.domain</code> ：首先通过您的帐户名  ssh 连接到 'randomhost.your.domain'，然后在该主机上执行 <code>sudo -u root</code> 。
</p>

<p>
上述示例中的  sudo 方法在到达主机后应用于主机而不是本地主机上是关键。因此，TRAMP 检查此类跃点的主机名是否与前一跃点的主机名匹配。
</p>

<p>
主机，用户和代理也可以采用  Lisp list。这些  list 求值必须返回字符串或  nil。
</p>

<p>
概括（来自前面的示例）：对于除本地主机之外的所有主机，首先通过  ssh 连接，然后应用 <code>sudo -u root</code> ：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'tramp-default-proxies-alist
             '(nil <span style="color: #ff4ea3;">"\\`</span><span style="color: #5fafd7;">root\\</span><span style="color: #ff4ea3;">'"</span> <span style="color: #ff4ea3;">"/ssh:%h:"</span>))
(add-to-list 'tramp-default-proxies-alist
             '((regexp-quote (system-name)) nil nil))
</pre>
</div>

<p>
通过跳跃涉及处理受限制的  shell，例如  rbash。如果  TRAMP 被识别，那么它将仅用于代理。
</p></li>

<li><p>
User Option: tramp-restricted-shell-hosts-alist
</p>

<p>
运行受限  shell 的主机的正则表达式的列表，例如  rbash。然后  TRAMP 将仅将它们用作代理。
</p>

<p>
要从上面的示例中指定堡垒主机作为运行受限  shell：
</p>

<div class="org-src-container">
<pre class="src src-sh">(add-to-list <span style="color: #ff4ea3;">'tramp-restricted-shell-hosts-alist</span>
<span style="color: #ff4ea3;">   "\\`bastion\\.your\\.domain\\'")</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org9c388df" class="outline-3">
<h3 id="org9c388df"><span class="section-number-3">5.9</span> 通过防火墙</h3>
<div class="outline-text-3" id="text-5-9">
<p>
有时，无法直接访问远程主机。可能会有防火墙妨碍，可以通过代理服务器穿过。
</p>

<p>
ssh 和  PuTTY 都支持这样的代理设置，通过  CONNECT 命令使用  HTTP 隧道（符合  RFC 2616,2817 规范）。使用  HTTP 1.1 或更高版本协议的代理服务器支持此命令。
</p>
</div>

<div id="outline-container-org2436f5f" class="outline-4">
<h4 id="org2436f5f"><span class="section-number-4">5.9.1</span> ssh 隧道</h4>
<div class="outline-text-4" id="text-5-9-1">
<p>
使用  ssh，您可以使用 <code>~/.ssh/config</code> 中的  ProxyCommand 条目：
</p>
<pre class="example">
Host host.other.domain
     ProxyCommand nc -X connect -x proxy.your.domain:3128 %h %p
</pre>
<p>
nc 是  BSD 的  netcat 程序，它建立  HTTP 隧道。也可以使用具有这种功能的任何其他程序。
</p>

<p>
在该示例中，打开 <code>/ssh:host.your.domain</code> ：在端口  3128 上通过  HTTP 代理服务器 “proxy.your.domain”。
</p>
</div>
</div>

<div id="outline-container-orgf898493" class="outline-4">
<h4 id="orgf898493"><span class="section-number-4">5.9.2</span> Tunneling with PuTTY</h4>
<div class="outline-text-4" id="text-5-9-2">
<p>
PuTTY 不需要外部程序，内置  HTTP 隧道支持。在  PuTTY 配置程序中，为 'host.your.domain' 创建一个会话。在 “Connection/Data” 条目中，选择  HTTP 选项，并将 “proxy.your.domain” 添加为代理主机名，将  3128 添加为 “端口”。
</p>

<p>
打开 <code>/plinkx:host.your.domain</code> ：在端口  3128 上传递  HTTP 代理服务器 'proxy.your.domain'。
</p>
</div>
</div>
</div>

<div id="outline-container-orgd470877" class="outline-3">
<h3 id="orgd470877"><span class="section-number-3">5.10</span> 使用非标准方法</h3>
<div class="outline-text-3" id="text-5-10">
<p>
tramp-methods 变量目前有一个详尽的预定义方法列表。可以修改此列表的任何部分更合适的设置。请参阅该变量的  Lisp 文档，可通过 <code>C-h v tramp-methods RET</code> 访问。
</p>

<p>
在  ELPA 档案中，有几个这样的扩展的例子。它们可以与  Emacs 的软件包管理器一起安装。这包括
</p>

<ul class="org-ul">
<li><p>
docker-tramp
</p>

<p>
Docker 容器的集成。通过 <code>/docker:user@container:/path/to/file</code> 访问容器：其中 'user' 是您要使用的（可选）用户，'container' 是容器的  ID 或名称。
</p></li>

<li><p>
kubernetes-tramp
</p>

<p>
集成在  Kubernetes 集群中的  Docker 容器。它衍生自 'docker-tramp'。通过 <code>/kubectl:user@container:/path/to/file</code> 访问容器，'user' 和 'container' 与 'docker-tramp' 中的含义相同。
</p></li>

<li><p>
lxc-tramp
</p>

<p>
LXC 容器的集成。通过 <code>/lxc:container:/path/to/file</code> 访问容器，'container' 与 'docker-tramp' 中的含义相同。忽略 “user” 规范。
</p></li>

<li><p>
lxd-tramp
</p>

<p>
LXD 容器的集成。通过 <code>/lxd:user@container:/path/to/file</code> 访问容器，'user' 和 'container' 与 'docker-tramp' 中的含义相同。
</p></li>

<li><p>
magit-tramp
</p>

<p>
使用  magit 浏览  git 存储库。通过 <code>/git:rev@root-dir:/path/to/file</code> 访问版本化文件。 'rev' 是一个  git 版本，'root-dir' 是根目录的虚拟主机名，在  magit-tramp-hosts-alist 中指定。
</p></li>

<li><p>
tramp-hdfs
</p>

<p>
访问  hadoop /hdfs 文件系统。通过 <code>/hdfs:user@node:/path/to/file</code> 访问文件，其中 'user' 是您要使用的用户，'node' 是  hadoop 服务器的名称。
</p></li>

<li><p>
vagrant-tramp
</p>

<p>
访问  vagrant box 的便捷方法。它经常用在像 <code>/vagrant:box|sudo:box:/path/to/file</code>  这样的多跳文件名中，其中 'box' 是  vagrant 的名称。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgff9f6d0" class="outline-3">
<h3 id="orgff9f6d0"><span class="section-number-3">5.11</span> 选择配置文件以补全用户/主机名</h3>
<div class="outline-text-3" id="text-5-11">
<p>
tramp-completion-function-alist 使用预定义文件来补全用户名和主机名（请参阅文件名完成）。 对于每个方法，它保留一组配置文件和一个可以解析该文件的函数。tramp-completion-function-alist 中的每个条目都是形式（方法  pair1 pair2 &#x2026;）。
</p>

<p>
每对由（函数文件）组成。function 负责从文件中提取用户名和主机名以完成。有两个函数可以访问这个变量：
</p>

<ul class="org-ul">
<li><p>
Function: tramp-get-completion-function method
</p>

<p>
此函数返回方法的补全函数列表。
</p>

<div class="org-src-container">
<pre class="src src-elisp">(tramp-get-completion-function <span style="color: #ff4ea3;">"rsh"</span>)
</pre>
</div>

<pre class="example">
   ⇒ ((tramp-parse-rhosts "/etc/hosts.equiv")
   (tramp-parse-rhosts "~/.rhosts"))
</pre></li>

<li><p>
Function: tramp-set-completion-function method function-list
</p>

<p>
此函数将  function-list 设置为方法的完成函数列表。
</p>

<div class="org-src-container">
<pre class="src src-elisp">(tramp-set-completion-function <span style="color: #ff4ea3;">"ssh"</span>
                               '((tramp-parse-sconfig <span style="color: #ff4ea3;">"/etc/ssh_config"</span>)
                                 (tramp-parse-sconfig <span style="color: #ff4ea3;">"~/.ssh/config"</span>)))

</pre>
</div>

<pre class="example">
⇒ ((tramp-parse-sconfig "/etc/ssh_config")
   (tramp-parse-sconfig "~/.ssh/config"))
</pre></li>
</ul>


<p>
下面预定的函数用来分析已经存在的配置文件：
</p>
</div>

<div id="outline-container-orgc1c7900" class="outline-4">
<h4 id="orgc1c7900"><span class="section-number-4">5.11.1</span> tramp-parse-rhosts</h4>
<div class="outline-text-4" id="text-5-11-1">
<p>
此函数解析语法等同于 <code>~/.rhosts</code> 的文件。如果指定，它将返回主机名和用户名。
</p>
</div>
</div>

<div id="outline-container-orga18cedd" class="outline-4">
<h4 id="orga18cedd"><span class="section-number-4">5.11.2</span> tramp-parse-shosts</h4>
<div class="outline-text-4" id="text-5-11-2">
<p>
此函数解析语法等同于 <code>~/.ssh/known_hosts</code> 的文件。由于此类文件中未指定用户名，因此只能返回主机名。
</p>
</div>
</div>

<div id="outline-container-orgd2b97d0" class="outline-4">
<h4 id="orgd2b97d0"><span class="section-number-4">5.11.3</span> tramp-parse-sconfig</h4>
<div class="outline-text-4" id="text-5-11-3">
<p>
此函数返回由 <code>~/.ssh/config</code> 样式文件中的主机条目定义的主机昵称。
</p>
</div>
</div>

<div id="outline-container-org80c8e8c" class="outline-4">
<h4 id="org80c8e8c"><span class="section-number-4">5.11.4</span> tramp-parse-shostkeys</h4>
<div class="outline-text-4" id="text-5-11-4">
<p>
SSH2 解析目录 <code>/etc/ssh2/hostkeys/*</code> 和 <code>~/ssh2/hostkeys/*</code> 。主机以文件名  hostkey_portnumber_host-name.pub 编码。用户名总是  nil。
</p>
</div>
</div>

<div id="outline-container-org1390e70" class="outline-4">
<h4 id="org1390e70"><span class="section-number-4">5.11.5</span> tramp-parse-sknownhosts</h4>
<div class="outline-text-4" id="text-5-11-5">
<p>
另一种  SSH2 样式解析目录， <code>/etc/ssh2/knownhosts/*</code> 和 <code>~/ssh2/knownhosts/*</code> ，在这种情况下，主机名称以文件名  host-name.algorithm.pub 编码。用户名总是  nil。
</p>
</div>
</div>

<div id="outline-container-orgce2165e" class="outline-4">
<h4 id="orgce2165e"><span class="section-number-4">5.11.6</span> tramp-parse-hosts</h4>
<div class="outline-text-4" id="text-5-11-6">
<p>
专用于 /etc/hosts 的主机名函数。
</p>
</div>
</div>

<div id="outline-container-org2057229" class="outline-4">
<h4 id="org2057229"><span class="section-number-4">5.11.7</span> tramp-parse-passwd</h4>
<div class="outline-text-4" id="text-5-11-7">
<p>
一个解析 /etc/passwd 用户名的函数。
</p>
</div>
</div>

<div id="outline-container-orgdf1905d" class="outline-4">
<h4 id="orgdf1905d"><span class="section-number-4">5.11.8</span> tramp-parse-etc-group</h4>
<div class="outline-text-4" id="text-5-11-8">
<p>
解析组名的 /etc/group 的函数。
</p>
</div>
</div>
