content/emacs/modes/tramp-mode.org
*** tramp-parse-netrc
    一个解析 =~/.netrc= 和 =~/.authinfo= 样式文件的函数。

    要在自定义结构中保留包含自定义数据的自定义文件，必须提供自定义函数。此功能必须符合以下约定：

    + Function: my-tramp-parse file

    file 必须是主机上的文件，或者是 nil。该函数必须返回（用户主机）列表，这些列表被视为完成用户名和主机名的候选者。

    #+BEGIN_SRC elisp
 (my-tramp-parse "~/.my-tramp-hosts")
    #+END_SRC

    #+BEGIN_EXAMPLE
 ⇒ ((nil "toto") ("daniel" "melancholia"))
    #+END_EXAMPLE

** 重用多个连接的密码
   为避免重复提示输入密码，请考虑本机缓存机制，例如类似 ssh 的方法的 ssh-agent，或类似 plink 的方法的 pageant。

   当原生解决方案无法满足需求时，TRAMP 提供替代方案。

*** 使用身份验证文件
    最初为 No Gnus 开发的软件包 auth-source.el 从不同的源读取密码，请参阅（auth）auth-source。默认的身份验证文件是~/.authinfo.gpg，但可以通过用户选项 auth-sources 进行更改。

    身份验证文件中的典型条目：
    #+BEGIN_EXAMPLE
machine melancholia port scp login daniel password geheim
    #+END_EXAMPLE

    端口可以​​采用任何 TRAMP 方法（请参阅内联方法，请参阅外部方法）。省略端口值匹配所有 TRAMP 方法。必须将 TRAMP 文件名语法中使用的域和端口附加到计算机和登录项：

    #+BEGIN_EXAMPLE
machine melancholia#4711 port davs login daniel%BIZARRE password geheim
    #+END_EXAMPLE

    如果没有正确的条目，则以交互方式读取密码。成功登录（验证密码）后，可以保存相应的条目以供支持此操作的 auth-source 后端进一步使用。可以通过将用户选项 auth-source-save-behavior 设置为 nil 来更改此设置。

    将 auth-source-debug 设置为 t 以调试消息。

    请注意，auth-source.el 不用于 ftp 连接，因为 TRAMP 将工作传递给 Ange FTP。例如，如果您需要使用 =~/.authinfo.gpg= 认证文件，则必须自定义 ange-ftp-netrc-filename：

    #+BEGIN_EXAMPLE
(customize-set-variable 'ange-ftp-netrc-filename "~/.authinfo.gpg")
    #+END_EXAMPLE

*** 缓存密码
    TRAMP 可以在输入时缓存密码，并在需要时重用与访问方法无关的相同用户或主机名。

    password-cache-expiry 设置记住密码的持续时间（以秒为单位）。密码永远不会永久保存，也不会超出当前 Emacs 会话的生命周期。将 password-cache-expiry 设置为 nil 以禁用到期。

    将 password-cache 设置为 nil 以禁用密码缓存。

** 重用连接相关信息
   为了加快初始连接时间，TRAMP 将先前的连接属性存储在用户选项 tramp-persistency-file-name 指定的文件中。

   tramp-persistency-file-name 的缺省文件名是 =~/.emacs.d/tramp= 。

   TRAMP 在 Emacs 启动期间读取此文件，并在退出 Emacs 时写入该文件。 删除此文件以便 TRAMP 在下一次 Emacs 启动时重新创建一个新文件。

   将 tramp-persistency-file-name 设置为 nil 以禁用持久存储连接。

   当 TRAMP 检测到远程主机中的操作系统版本发生更改时（通过命令 uname -sr），它会刷新该主机的所有连接相关信息并创建新条目。

** 设置连接相关信息
   为了更精确地定制，可以手动覆盖 tramp-methods 指定的参数。

   设置 tramp-connection-properties 以手动覆盖 tramp-methods。 此列表中的属性采用 =(regexp property value)= 格式。regexp 匹配远程文件名。使用 nil 匹配所有。property 是属性的名称，value 是属性的值。

   property 是 tramp-methods 中包含的任何特定于方法的参数。tramp-methods 中的参数键是符号名称 tramp-<foo>。 要覆盖该属性，请使用字符串 '<foo>' 作为属性。 例如，这会更改远程 shell：

   #+BEGIN_SRC elisp
(add-to-list 'tramp-connection-properties
			 (list (regexp-quote "/ssh:user@randomhost.your.domain:")
				 "busybox" t))
   #+END_SRC
   远程主机的 tramp-methods 中的参数 tramp-remote-shell 和 tramp-remote-shell-login 现在具有的新值。

   常见用例是覆盖连接的会话超时，即连接被禁用后的时间（以秒为单位），并且必须重新建立。 这可以为任何连接设置； 对于 sudo 和 doas 方法，存在预定义的值。 值为 nil 会禁用此功能。 例如：
   #+BEGIN_SRC elisp
 (add-to-list 'tramp-connection-properties
 (list (regexp-quote "/sudo:root@system-name:")
 "session-timeout" 30))
   #+END_SRC

   'system-name' 代表函数 =(system-name)= 返回的主机。

   property 也可以是 tramp-persistency-file-name 中的任何属性。

   要了解受限制的 shell 如何随机删除连接，请设置特殊属性 “busybox”。 例如：
   #+BEGIN_SRC elisp
(add-to-list 'tramp-connection-properties
 (list (regexp-quote "/ssh:user@randomhost.your.domain:")
 "busybox" t))
   #+END_SRC

** TRAMP 如何在远程主机上查找和使用程序
   TRAMP 需要访问远程主机上的几个命令并对其拥有执行权限：ls，test，find 和 cat。

   除此之外，Inline 方法和外部连接方法还有其他必需的程序。

   为了提高远程文件访问的性能和准确性，TRAMP 在可用时使用 perl（或 perl5）和 grep。

   + 用户选项：tramp-remote-path

   tramp-remote-path 指定 TRAMP 可以搜索远程程序的远程目录路径。

   TRAMP 使用标准默认值，例如 /bin 和 /usr/bin，这对大多数主机都是合理的。为了适应主机和路径的差异，例如，Debian GNU/Linux 上的 =/bin:/usr/bin= 或 Solaris 上的 =/usr/xpg4/bin:/usr/ccs/bin:/usr/bin:/opt/SUNWspro/bin= ，TRAMP 使用 =getconf PATH= 查询远程主机并更新符号 tramp-default-remote-path。

   对于出于安全原因主机保留路径模糊位置的实例，请手动将此类路径添加到本地. emacs，如下所示，以便在连接时使用 TRAMP。

   #+BEGIN_SRC elisp
(add-to-list 'tramp-remote-path "/usr/local/perl/bin")
   #+END_SRC
   查找远程路径的另一种方法是使用远程主机分配给远程用户的路径。登录后 TRAMP 通常不会保留此远程路径。但是，tramp-own-remote-path 会保留路径值，该值可用于更新 tramp-remote-path。
   #+BEGIN_EXAMPLE elisp
(add-to-list 'tramp-remote-path 'tramp-own-remote-path)
   #+END_EXAMPLE

   请注意，仅当您的 remote /bin/sh shell 支持登录参数 '-l' 时，此方法才有效。

   更改远程搜索路径时，必须重新计算本地 TRAMP 缓存。要强制 TRAMP 重新计算，请调用 M-x tramp-cleanup-this-connection RET 或 friends（请参阅清理远程连接）。

