content/emacs/modes/tramp-mode.org
** 远程 shell 设置技巧
   TRAMP 检查通常位置的标准程序的可用性。常见的策略包括先后尝试 =test -e，/usr/bin /test -e= 和 =/bin/test -e= 。 =ls -d= 是另一种方法。但是这些方法对这些新的登录模式没有帮助。

   当 TRAMP 遇到双因素登录或其他挑战问题时，例如输入出生日期或安全代码或密码短语，TRAMP 需要更多配置步骤来适应它们。

   密码提示和密码短语提示之间的区别在于，密码（password）用于完成登录，短语（passphrase）用于授权访问本地身份验证信息（例如 ssh 密钥）。

   没有一种配置可以适应登录安全性的所有变化。然而，TRAMP 提供了一些调整来解决最常见的问题。

   + tramp-shell-prompt-pattern

   tramp-shell-prompt-pattern 用于远程登录 shell 提示符，可能与本地登录 shell 提示符 shell-prompt-pattern 不同。由于大多数主机使用相同的提示，因此 TRAMP 会为两个提示设置类似的默认值。

   + tramp-password-prompt-regexp
   + tramp-wrong-passwd-regexp

   TRAMP 使用 tramp-password-prompt-regexp 来区分密码提示和密码短语提示。默认情况下，tramp-password-prompt-regexp 处理英语语言环境中的检测。请参阅下面的本地化示例：
   #+BEGIN_EXAMPLE elisp
(customize-set-variable
 'tramp-password-prompt-regexp
(concat
 "^.*"
 (regexp-opt
'("passphrase" "Passphrase"
;; English
"password" "Password"
;; Deutsch
"passwort" "Passwort"
;; Français
"mot de passe" "Mot de passe")
t)
 ".*:\0? *"))
   #+END_EXAMPLE

   处理错误的密码提示可能需要类似的本地化，为此 TRAMP 使用 tramp-wrong-passwd-regexp。

   + tramp-terminal-type

   TRAMP 使用用户选项 tramp-terminal-type 为其运行的 shell 设置远程环境变量 TERM。默认情况下，它是 “"dumb"”，但可以更改。dump 终端最适合运行 TRAMP 的后台会话。但是，运行交互式远程 shell 可能需要不同的设置。这可以通过在 process-environment 中调整 TERM 环境变量来实现。

   #+BEGIN_SRC elisp
(let ((process-environment
 (cons "TERM=xterm-256color" process-environment)))
(shell))
   #+END_SRC

   + Determining a TRAMP session

   有时，需要确定 shell 是否在 TRAMP 控制下运行。 环境变量 TERM 的设置将有助于：
   #+BEGIN_SRC sh
if test "$TERM" = "dumb"; then
 ...
fi
   #+END_SRC
   另一种可能性是检查环境变量 INSIDE_EMACS。 与 Emacs 的所有子进程一样，这将设置为父 Emacs 进程的版本，请参阅（emacs）Interactive Shell。TRAMP 将自己的包版本添加到此字符串中，该字符串可用于 inferior shell 中的进一步测试。 该环境变量的字符串看起来总是如此：
   #+BEGIN_EXAMPLE
echo $INSIDE_EMACS
⇒ 26.2,tramp:2.3.4
   #+END_EXAMPLE
   + tset and other questions

   为了抑制对终端类型的不适当提示，TRAMP 在远程登录过程开始之前通过用户选项 tramp-terminal-type 设置 TERM 环境变量（参见上文）。 这将使常见的 tset 相关提示无声。

   TRAMP 处理此类提示的策略（通常从远程主机上的登录脚本触发）是设置环境变量，以便没有提示中断 shell 初始化过程。

   另一种方法是使用字符串配置 TRAMP，这些字符串可以使用 tramp-actions-before-shell 来识别这些问题。 例：

   #+BEGIN_SRC elisp
(defconst my-tramp-prompt-regexp
(concat (regexp-opt '("Enter the birth date of your mother:") t)
		"\\s-*")
"Regular expression matching my login prompt question.")

(defun my-tramp-action (proc vec)
"Enter \"19000101\" in order to give a correct answer."
(save-window-excursion
	(with-current-buffer (tramp-get-connection-buffer vec)
	(tramp-message vec 6 "\n%s" (buffer-string))
	(tramp-send-string vec "19000101"))))

(add-to-list 'tramp-actions-before-shell
			 '(my-tramp-prompt-regexp my-tramp-action))
   #+END_SRC
   + .profile 中用户和变量的名称冲突

   当用户名与本地文件（例如. profile）中的变量名相同时，TRAMP 可能会为环境变量发送不正确的值。要避免不正确的值，请将本地变量名称更改为与用户名不同的名称。例如，如果用户名是 FRUMPLE，则将变量名称更改为 FRUMPLE_DIR。

   + .profile 中的非 Bourne 命令

   当远程主机的. profile 也用于 Bourne shell 以外的 shell 时，.profile 中命令的某些不兼容语法可能会在主机上的 Bourne shell 中触发错误，并且可能无法完成客户端的 TRAMP 连接。

   .profile 中 Bourne shell 不兼容语法的一个示例：使用 ~export FOO=bar~ 而不是 ~FOO=bar; export FOO~ 。远程登录后，TRAMP 将在远程主机上执行 /bin/sh 期间触发错误，因为 Bourne shell 无法识别在. profile 中输入的导出命令。

   同样，路径中的（~）字符会导致错误，因为 Bourne shell 不执行（~）字符扩展。

   避免这些不兼容性的一种方法是使~/.shrc 和~/.profile Bourne shell 中的所有命令兼容，以便 TRAMP 可以完成与该远程的连接。要在该遥控器上使用非 Bourne shell，请使用其他特定于 shell 的配置文件。例如，bash 可以使用~/.bash_profile 并忽略. profile。

   + 交互式 shell 提示符

   TRAMP 在内部重新定义远程 shell 提示以进行强大的解析。此重定义通过命令（如 M-x shell RET）影响交互式远程 shell 中提示的外观。但是，这些提示可以使用这些环境变量重置为更易读和可识别的内容。

   TRAMP 在启动脚本文件~/.emacs_SHELLNAME 中设置 INSIDE_EMACS 环境变量。

   SHELLNAME 是 bash 或等效的 shell 名称。通过在. emacs 中设置环境变量 ESHELL 来更改它，如下所示：
   #+BEGIN_SRC elisp
(setenv "ESHELL" "bash")
   #+END_SRC
   然后在~/.emacs_SHELLNAME 中重新设置提示字符串，如下所示：
   #+BEGIN_SRC sh
# Reset the prompt for remote TRAMP shells.
if [ "${INSIDE_EMACS/*tramp*/tramp}" == "tramp" ] ; then
 PS1="[\u@\h \w]$ "
fi

   #+END_SRC
   + busybox/nc

   TRAMP 的 nc 方法使用 nc 命令来安装和执行一个监听器，如下所示（请参阅 tramp-methods）：
   #+BEGIN_SRC sh
$ nc -l -p 42
   #+END_SRC

   上面的命令行语法已随 busybox 版本更改。 如果 nc 拒绝 '-p' 参数，则覆盖如下：
   #+BEGIN_SRC elisp
(add-to-list
 'tramp-connection-properties
 `(,(regexp-quote "192.168.0.1")
 "remote-copy-args" (("-l") ("%r"))))
   #+END_SRC

   其中 '192.168.0.1' 是远程主机 IP 地址（请参阅预定义连接信息）。
** Android shell 设置技巧
   TRAMP 使用 adb 方法访问 Android 设备。Android 设备通过 USB 连接提供受限制的 shell 访问。本地主机必须安装 adb 程序。通常，打开文件 /adb::/ 就足够了。然后，可以通过 dired 在文件系统中导航。

   或者，在 Android 设备上运行 sshd 进程的 Termux 或 SSHDroid 等应用程序可以接受任何基于 ssh 的方法，只要这些设置被调整：

   + 必须为远程 shell 指定 sh，因为 Android 设备不提供 /bin/sh。然后，sh 将使用以下设置调用设备上安装的任何 shell：
   #+BEGIN_SRC elisp
(add-to-list 'tramp-connection-properties
	 (list (regexp-quote "192.168.0.26") "remote-shell" "sh"))
   #+END_SRC

   where ‘192.168.0.26’ is the Android device’s IP address. (see Predefined connection information).

   + TRAMP 需要从用户设置中保留 PATH 环境变量。Android 设备更喜欢 /system/xbin path over /system/bin。这两个设置如下：
   #+BEGIN_SRC elisp
（add-to-list'tramp-connection-properties
（list（regexp-quote“android”）“remote-shell”“sh”））
   #+END_SRC

   + 当 Android 设备未 “rooted” 时，请为临时文件指定可写目录：
   #+BEGIN_SRC elisp
(add-to-list 'tramp-remote-path 'tramp-own-remote-path)
(add-to-list 'tramp-remote-path "/system/xbin")
   #+END_SRC
   + 使用命令 C-x C-f /ssh:192.168.0.26#2222：RET 打开远程连接，其中 sshd 正在侦听端口 '2222'。

   要在~/.ssh/config 文件中添加相应的条目（推荐），请使用以下命令：
   #+BEGIN_EXAMPLE
Host android
 HostName 192.168.0.26
 User root
 Port 2222
   #+END_EXAMPLE

   要使用主机名 'android' 而不是上一个示例中显示的 IP 地址，请按如下所示修复连接属性：
   #+BEGIN_SRC elisp
(add-to-list 'tramp-connection-properties
	 (list (regexp-quote "android") "remote-shell" "sh"))
   #+END_SRC
   使用更简洁的命令 C-x C-f /ssh：android：RET 打开远程连接。

