content/emacs/modes/tramp-mode.org
** 自动保存和备份配置
   为避免 TRAMP 将 “root” 拥有的备份文件保存到其他人可访问的位置，必须更改 backup-directory-alist 中的默认备份设置。

   这是一个可能无意中暴露文件的场景。 默认情况下，Emacs 将备份文件写入与原始文件相同的目录，除非更改为其他位置，例如~/.emacs.d/backups/。 当使用限制文件 =/su:root@localhost:/etc/secretfile= 时，TRAMP 默认也会使用这样的目录。secretfile 文件的备份文件现在由从 TRAMP 登录的用户拥有，而不是 “root”。

   当 backup-directory-alist 为 nil（默认值）时，不会发生此类问题。

   要 “关闭” 远程文件的备份功能并停止 TRAMP 保存到备份目录，请使用以下命令：

   #+BEGIN_SRC elisp
(add-to-list 'backup-directory-alist
			 (cons tramp-file-name-regexp nil))
   #+END_SRC

   禁用备份可以仅针对 su 和 sudo 方法：

   #+BEGIN_SRC elisp
(setq backup-enable-predicate
	(lambda (name)
		(and (normal-backup-enable-predicate name)
			 (not
			(let ((method (file-remote-p name 'method)))
				(when (stringp method)
				(member method '("su" "sudo"))))))))
   #+END_SRC

   另一种选择是创建更好的备份文件命名，其中用户名和主机名以文件名为前缀。例如，将 /etc/secretfile 转换为 =~/.emacs.d/backups/!su:root@localhost:!etc!secretfile= ，从现有用户选项 backup-directory 设置 TRAMP 用户选项 tramp-backup-directory-alist。

   然后 TRAMP 备份到一个文件名，该文件名使用由 DIRECTORY 名称组成的前缀进行转换。仅当 DIRECTORY 是绝对本地文件名时才会出现此文件名前缀。

   #+BEGIN_SRC elisp
(add-to-list 'backup-directory-alist
			 (cons "." "~/.emacs.d/backups/"))
(setq tramp-backup-directory-alist backup-directory-alist)
   #+END_SRC
   =/su:root@localhost:/etc/secretfile= 备份文件名将是 =/su:root@localhost:~/.emacs.d/backups/!su:root@localhost:!etc!secretfile~=

   与备份文件一样，类似的文件命名问题也会影响自动保存的远程文件。自动保存的文件保存在用户选项 auto-save-file-name-transforms 指定的目录中。默认情况下，它设置为本地临时目录。但是在某些版本的 Debian GNU/Linux 中，这指向编译 Emacs 的源目录。将这些值重置为有效目录。

   将 auto-save-file-name-transforms 设置为 nil，将自动保存的文件保存到与原始文件相同的目录中。

   或者，设置用户选项 tramp-auto-save-directory 以将所有自动保存定向到该位置。

** Cygwin ssh 问题
   本节不完整。请分享您的解决方案。

   Cygwin 的 ssh 仅适用于 Cygwin 版本的 Emacs。要检查兼容性：键入 M-x eshell RET，然后启动 ssh test.host RET。不兼容性会触发此消息：
   #+BEGIN_EXAMPLE
Pseudo-terminal will not be allocated because stdin is not a terminal.
   #+END_EXAMPLE

   由于 stdin 不是终端，因此不会分配伪终端。

   一些旧版本的 Cygwin 的 ssh 使用 sshx 访问方法。有关详细信息，请参阅https://cygwin.com/faq/ 上的 Cygwin 常见问题解答。

   在 Emacs Wiki 上，它解释了如何使用帮助程序 fakecygpty 来解决这个问题。

   使用 scpx 访问方法时，Emacs 可能会调用带有 MS Windows 文件命名的 scp，例如 c:/foo。但是与 Cygwin 一起安装的 scp 版本不知道 MS Windows 文件命名，这导致它错误地查找名为 c 的主机。

   解决方法：为 scp 编写包装脚本，将 Windows 文件名转换为 Cygwin 文件名。

   在 MS Windows 上使用 ssh-agent 进行无密码交互时，ssh 方法依赖于环境变量 SSH_AUTH_SOCK。但是，当从桌面快捷方式启动 Emacs 并且身份验证失败时，不会设置此变量。

   一种解决方法是使用基于 MS Windows 的 SSH 代理，例如 Pageant。它是 Putty Suite 工具的一部分。

   备用选择是从 shell 启动 Emacs。

* Using TRAMP
  TRAMP 以透明方式运行，访问远程文件，就像它们是本地文件一样。 但是，TRAMP 采用形式化的远程文件命名语法来透明地执行其功能。 此语法由指定访问方法，身份验证，主机名和文件名的许多部分组成。Ange FTP 使用类似的语法。

  与在 Emacs 中打开本地文件不同，它们是瞬时打开的，因此在 TRAMP 中打开远程文件的速度较慢。有时在迷你缓冲区中出现密码或身份验证提示之前会有明显的延迟。在此间隙期间按 RET 或其他键将由 Emacs 处理。 这种预先输入设施是 Emacs 的一项功能，在使用 TRAMP 时可能会导致错过提示。

** TRAMP file name conventions
   + /method:host:/path/to/file

   opens file /path/to/file on the remote host host, using the method method.

   + /ssh:melancholia:.emacs

   For the file .emacs located in the home directory, on the host melancholia, using method ssh.

   + /ssh:melancholia.danann.net:.emacs

   For the file .emacs specified using the fully qualified domain name of the host.

   + /ssh:melancholia:~/.emacs

   For the file .emacs specified using the ~, which is expanded.

   + /ssh:melancholia:~daniel/.emacs

   For the file .emacs located in daniel’s home directory on the host, melancholia. The ~<user> construct is expanded to the home directory of that user on the remote host.

   + /ssh:melancholia:/etc/squid.conf

   For the file /etc/squid.conf on the host melancholia.


   host 可以使用 IPv4 或 IPv6 地址，如 /ssh:127.0.0.1:.emacs 或 /ssh:[::1::.emacs。 出于语法原因，IPv6 地址必须嵌入方括号 [和] 中。

   缺省情况下，TRAMP 将使用当前本地用户名作为远程用户名登录远程主机。 使用正确的语法指定其他名称将覆盖此默认行为：

   #+BEGIN_EXAMPLE
/method:user@host:path/to/file
   #+END_EXAMPLE

   /ssh:daniel@melancholia:.emacs is for file .emacs in daniel’s home directory on the host, melancholia, accessing via method ssh.

   要指定端口号，请将＃<port> 放在主机名后。 例如： =/ssh:daniel@melancholia#42:.emacs= 。

   所有方法，用户名，主机名，端口号和本地名称部分都是可选的，请参见默认方法，请参见默认用户，请参阅默认主机。 出于语法原因，默认方法必须由伪方法指示 - 。

** Alternative file name syntax
   文件名语法中描述的语法是在 Emacs 启动后的默认语法。 但是，这可以改变。

   + Command: tramp-change-syntax syntax

   此命令更改 TRAMP 用于远程文件名的语法。 除了默认值，语法也可以
   + simplified
   远程文件名语法类似于 Ange FTP 使用的语法。远程文件名的格式为 /user@host:path/to/file。user @ part 是可选的，该方法由 Default Method 确定。

   + separate

   远程文件名语法类似于 XEmacs 使用的语法。 远程文件名的格式为/[method/user@host]path/to/file。方法和 user@parts 是可选的。

   + Variable: tramp-file-name-regexp

   此变量保留与所选远程文件名语法匹配的正则表达式。 每次调用 tramp-change-syntax 后，它的值都会发生变化。 但是，不建议在外部包中使用此变量，调用 file-remote-p 更合适。

** File name completion
   TRAMP 可以补全以下 TRAMP 文件名组件：位于远程主机上的方法名称，用户名，主机名和文件名。通过激活. emacs 中的部分补全来启用此功能。

   例如，键入 =C-x C-f / s TAB=，TRAMP 完成选项显示为

   #+BEGIN_EXAMPLE
sbin/
scp:
scpx:
sftp:
sg:
smb:
srv/
ssh:
sshx:
su:
sudo:
sys/
   #+END_EXAMPLE
   'ssh:' 是相应方法的可能完成，'sbin/' 代表本地主机上的目录 /sbin。

   键入 s h：将迷你缓冲区完成为 '/ssh:'。例如，键入 TAB 显示主机名 TRAMP 从~/.ssh/config 文件中提取。

   #+BEGIN_EXAMPLE
ssh:127.0.0.1:
ssh:192.168.0.1:
ssh:[::1]:
ssh:localhost:
ssh:melancholia.danann.net:
ssh:melancholia:
   #+END_EXAMPLE
   从上面的列表中选择一个主机，然后继续在该主机上补全文件名。

   当配置（请参阅自定义完成）包括用户名时，完成列表也将考虑用户名。

   来自 auth-sources 搜索的结果（请参阅使用身份验证文件）将添加到完成候选项中。这种搜索可能很烦人，例如由于~/.authinfo.gpg 认证文件的密码短语请求。用户选项 tramp-completion-use-auth-sources 控制是否在补全期间执行此类搜索。

   以前访问过的远程主机或其连续保持连接的主机（请参阅连接缓存）将包含在补全列表中。

   远程主机名补全后，补全远程主机上的文件名。它与本地主机文件完成的工作方式相同，只是使用双斜杠 // 仅删除 TRAMP 文件名语法的文件名部分。三斜杠代表默认行为。

   Example:
   #+BEGIN_EXAMPLE
C-x C-f /telnet:melancholia:/usr/local/bin//etc TAB
	-| /telnet:melancholia:/etc

C-x C-f /telnet:melancholia://etc TAB
	-| /etc

C-x C-f /telnet:melancholia:/usr/local/bin///etc TAB
	-| /etc
   #+END_EXAMPLE

   在文件名补全期间，将定期重新读取远程目录内容，以避免文件系统中可能影响完成候选项的任何更改。此类重新读取可以解释 Emacs 外部应用程序对文件系统的更改（请参阅连接缓存）。

   + 用户选项：tramp-completion-reread-directory-timeout

   超时是自上次远程命令重新读取远程目录内容以来的秒数。在文件名完成期间，值 0 立即重新读取，nil 使用缓存的目录内容。

