emacs/modes/tramp-mode.html

<div id="outline-container-org5c9cc29" class="outline-3">
<h3 id="org5c9cc29"><span class="section-number-3">5.18</span> 自动保存和备份配置</h3>
<div class="outline-text-3" id="text-5-18">
<p>
为避免  TRAMP 将 “root” 拥有的备份文件保存到其他人可访问的位置，必须更改  backup-directory-alist 中的默认备份设置。
</p>

<p>
这是一个可能无意中暴露文件的场景。 默认情况下，Emacs 将备份文件写入与原始文件相同的目录，除非更改为其他位置，例如~/.emacs.d/backups/。 当使用限制文件 <code>/su:root@localhost:/etc/secretfile</code> 时，TRAMP 默认也会使用这样的目录。secretfile 文件的备份文件现在由从  TRAMP 登录的用户拥有，而不是 “root”。
</p>

<p>
当  backup-directory-alist 为  nil（默认值）时，不会发生此类问题。
</p>

<p>
要 “关闭” 远程文件的备份功能并停止  TRAMP 保存到备份目录，请使用以下命令：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'backup-directory-alist
             (cons tramp-file-name-regexp nil))
</pre>
</div>

<p>
禁用备份可以仅针对  su 和  sudo 方法：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> backup-enable-predicate
      (<span style="color: #a1db00;">lambda</span> (name)
        (<span style="color: #a1db00;">and</span> (normal-backup-enable-predicate name)
             (not
              (<span style="color: #a1db00;">let</span> ((method (file-remote-p name 'method)))
                (<span style="color: #a1db00;">when</span> (stringp method)
                  (member method '(<span style="color: #ff4ea3;">"su"</span> <span style="color: #ff4ea3;">"sudo"</span>))))))))
</pre>
</div>

<p>
另一种选择是创建更好的备份文件命名，其中用户名和主机名以文件名为前缀。例如，将 <i>etc/secretfile 转换为 =~</i>.emacs.d/backups/!su:root@localhost:!etc!secretfile= ，从现有用户选项  backup-directory 设置  TRAMP 用户选项  tramp-backup-directory-alist。
</p>

<p>
然后  TRAMP 备份到一个文件名，该文件名使用由  DIRECTORY 名称组成的前缀进行转换。仅当  DIRECTORY 是绝对本地文件名时才会出现此文件名前缀。
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'backup-directory-alist
             (cons <span style="color: #ff4ea3;">"."</span> <span style="color: #ff4ea3;">"~/.emacs.d/backups/"</span>))
(<span style="color: #a1db00;">setq</span> tramp-backup-directory-alist backup-directory-alist)
</pre>
</div>
<p>
<code>/su:root@localhost:/etc/secretfile</code> 备份文件名将是 <code>/su:root@localhost:~/.emacs.d/backups/!su:root@localhost:!etc!secretfile~</code>
</p>

<p>
与备份文件一样，类似的文件命名问题也会影响自动保存的远程文件。自动保存的文件保存在用户选项  auto-save-file-name-transforms 指定的目录中。默认情况下，它设置为本地临时目录。但是在某些版本的  Debian GNU/Linux 中，这指向编译  Emacs 的源目录。将这些值重置为有效目录。
</p>

<p>
将  auto-save-file-name-transforms 设置为  nil，将自动保存的文件保存到与原始文件相同的目录中。
</p>

<p>
或者，设置用户选项  tramp-auto-save-directory 以将所有自动保存定向到该位置。
</p>
</div>
</div>

<div id="outline-container-orgd68556c" class="outline-3">
<h3 id="orgd68556c"><span class="section-number-3">5.19</span> Cygwin ssh 问题</h3>
<div class="outline-text-3" id="text-5-19">
<p>
本节不完整。请分享您的解决方案。
</p>

<p>
Cygwin 的  ssh 仅适用于  Cygwin 版本的  Emacs。要检查兼容性：键入  M-x eshell RET，然后启动  ssh test.host RET。不兼容性会触发此消息：
</p>
<pre class="example">
Pseudo-terminal will not be allocated because stdin is not a terminal.
</pre>

<p>
由于  stdin 不是终端，因此不会分配伪终端。
</p>

<p>
一些旧版本的  Cygwin 的  ssh 使用  sshx 访问方法。有关详细信息，请参阅  <a href="https://cygwin.com/faq/">https://cygwin.com/faq/</a> 上的  Cygwin 常见问题解答。
</p>

<p>
在  Emacs Wiki 上，它解释了如何使用帮助程序  fakecygpty 来解决这个问题。
</p>

<p>
使用  scpx 访问方法时，Emacs 可能会调用带有  MS Windows 文件命名的  scp，例如  c:/foo。但是与  Cygwin 一起安装的  scp 版本不知道  MS Windows 文件命名，这导致它错误地查找名为  c 的主机。
</p>

<p>
解决方法：为  scp 编写包装脚本，将  Windows 文件名转换为  Cygwin 文件名。
</p>

<p>
在  MS Windows 上使用  ssh-agent 进行无密码交互时，ssh 方法依赖于环境变量  SSH_AUTH_SOCK。但是，当从桌面快捷方式启动  Emacs 并且身份验证失败时，不会设置此变量。
</p>

<p>
一种解决方法是使用基于  MS Windows 的  SSH 代理，例如  Pageant。它是  Putty Suite 工具的一部分。
</p>

<p>
备用选择是从  shell 启动  Emacs。
</p>
</div>
</div>
</div>

<div id="outline-container-orgc7c2356" class="outline-2">
<h2 id="orgc7c2356"><span class="section-number-2">6</span> Using TRAMP</h2>
<div class="outline-text-2" id="text-6">
<p>
TRAMP 以透明方式运行，访问远程文件，就像它们是本地文件一样。 但是，TRAMP 采用形式化的远程文件命名语法来透明地执行其功能。 此语法由指定访问方法，身份验证，主机名和文件名的许多部分组成。Ange FTP 使用类似的语法。
</p>

<p>
与在  Emacs 中打开本地文件不同，它们是瞬时打开的，因此在  TRAMP 中打开远程文件的速度较慢。有时在迷你缓冲区中出现密码或身份验证提示之前会有明显的延迟。在此间隙期间按  RET 或其他键将由  Emacs 处理。 这种预先输入设施是  Emacs 的一项功能，在使用  TRAMP 时可能会导致错过提示。
</p>
</div>

<div id="outline-container-org7ba869d" class="outline-3">
<h3 id="org7ba869d"><span class="section-number-3">6.1</span> TRAMP file name conventions</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li><p>
/method:host:/path/to/file
</p>

<p>
opens file /path/to/file on the remote host host, using the method method.
</p></li>

<li><p>
/ssh:melancholia:.emacs
</p>

<p>
For the file .emacs located in the home directory, on the host melancholia, using method ssh.
</p></li>

<li><p>
/ssh:melancholia.danann.net:.emacs
</p>

<p>
For the file .emacs specified using the fully qualified domain name of the host.
</p></li>

<li><p>
<i>ssh:melancholia:~</i>.emacs
</p>

<p>
For the file .emacs specified using the ~, which is expanded.
</p></li>

<li><p>
<i>ssh:melancholia:~daniel</i>.emacs
</p>

<p>
For the file .emacs located in daniel’s home directory on the host, melancholia. The ~&lt;user&gt; construct is expanded to the home directory of that user on the remote host.
</p></li>

<li><p>
/ssh:melancholia:/etc/squid.conf
</p>

<p>
For the file /etc/squid.conf on the host melancholia.
</p></li>
</ul>


<p>
host 可以使用  IPv4 或  IPv6 地址，如 /ssh:127.0.0.1:.emacs 或 /ssh:[::1::.emacs。 出于语法原因，IPv6 地址必须嵌入方括号 [和] 中。
</p>

<p>
缺省情况下，TRAMP 将使用当前本地用户名作为远程用户名登录远程主机。 使用正确的语法指定其他名称将覆盖此默认行为：
</p>

<pre class="example">
/method:user@host:path/to/file
</pre>

<p>
/ssh:daniel@melancholia:.emacs is for file .emacs in daniel’s home directory on the host, melancholia, accessing via method ssh.
</p>

<p>
要指定端口号，请将＃&lt;port&gt; 放在主机名后。 例如： <code>/ssh:daniel@melancholia#42:.emacs</code> 。
</p>

<p>
所有方法，用户名，主机名，端口号和本地名称部分都是可选的，请参见默认方法，请参见默认用户，请参阅默认主机。 出于语法原因，默认方法必须由伪方法指示 - 。
</p>
</div>
</div>

<div id="outline-container-orgdc8f105" class="outline-3">
<h3 id="orgdc8f105"><span class="section-number-3">6.2</span> Alternative file name syntax</h3>
<div class="outline-text-3" id="text-6-2">
<p>
文件名语法中描述的语法是在  Emacs 启动后的默认语法。 但是，这可以改变。
</p>

<ul class="org-ul">
<li><p>
Command: tramp-change-syntax syntax
</p>

<p>
此命令更改  TRAMP 用于远程文件名的语法。 除了默认值，语法也可以
</p>
<ul class="org-ul">
<li>simplified
远程文件名语法类似于  Ange FTP 使用的语法。远程文件名的格式为 /user@host:path/to/file。user @ part 是可选的，该方法由  Default Method 确定。</li>

<li><p>
separate
</p>

<p>
远程文件名语法类似于  XEmacs 使用的语法。 远程文件名的格式为  /[method/user@host]path/to/file。方法和  user@parts 是可选的。
</p></li>
</ul></li>

<li><p>
Variable: tramp-file-name-regexp
</p>

<p>
此变量保留与所选远程文件名语法匹配的正则表达式。 每次调用  tramp-change-syntax 后，它的值都会发生变化。 但是，不建议在外部包中使用此变量，调用  file-remote-p 更合适。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orge82339b" class="outline-3">
<h3 id="orge82339b"><span class="section-number-3">6.3</span> File name completion</h3>
<div class="outline-text-3" id="text-6-3">
<p>
TRAMP 可以补全以下  TRAMP 文件名组件：位于远程主机上的方法名称，用户名，主机名和文件名。通过激活. emacs 中的部分补全来启用此功能。
</p>

<p>
例如，键入 =C-x C-f / s TAB=，TRAMP 完成选项显示为
</p>

<pre class="example">
sbin/
scp:
scpx:
sftp:
sg:
smb:
srv/
ssh:
sshx:
su:
sudo:
sys/
</pre>
<p>
'ssh:' 是相应方法的可能完成，'sbin/' 代表本地主机上的目录 /sbin。
</p>

<p>
键入  s h：将迷你缓冲区完成为 '<i>ssh:'。例如，键入  TAB 显示主机名  TRAMP 从~</i>.ssh/config 文件中提取。
</p>

<pre class="example">
ssh:127.0.0.1:
ssh:192.168.0.1:
ssh:[::1]:
ssh:localhost:
ssh:melancholia.danann.net:
ssh:melancholia:
</pre>
<p>
从上面的列表中选择一个主机，然后继续在该主机上补全文件名。
</p>

<p>
当配置（请参阅自定义完成）包括用户名时，完成列表也将考虑用户名。
</p>

<p>
来自  auth-sources 搜索的结果（请参阅使用身份验证文件）将添加到完成候选项中。这种搜索可能很烦人，例如由于~/.authinfo.gpg 认证文件的密码短语请求。用户选项  tramp-completion-use-auth-sources 控制是否在补全期间执行此类搜索。
</p>

<p>
以前访问过的远程主机或其连续保持连接的主机（请参阅连接缓存）将包含在补全列表中。
</p>

<p>
远程主机名补全后，补全远程主机上的文件名。它与本地主机文件完成的工作方式相同，只是使用双斜杠 // 仅删除  TRAMP 文件名语法的文件名部分。三斜杠代表默认行为。
</p>

<p>
Example:
</p>
<pre class="example">
C-x C-f /telnet:melancholia:/usr/local/bin//etc TAB
	-| /telnet:melancholia:/etc

C-x C-f /telnet:melancholia://etc TAB
	-| /etc

C-x C-f /telnet:melancholia:/usr/local/bin///etc TAB
	-| /etc
</pre>

<p>
在文件名补全期间，将定期重新读取远程目录内容，以避免文件系统中可能影响完成候选项的任何更改。此类重新读取可以解释  Emacs 外部应用程序对文件系统的更改（请参阅连接缓存）。
</p>

<ul class="org-ul">
<li><p>
用户选项：tramp-completion-reread-directory-timeout
</p>

<p>
超时是自上次远程命令重新读取远程目录内容以来的秒数。在文件名完成期间，值  0 立即重新读取，nil 使用缓存的目录内容。
</p></li>
</ul>
</div>
</div>
