emacs/modes/tramp-mode.html

<div id="outline-container-org6ba5e04" class="outline-3">
<h3 id="org6ba5e04"><span class="section-number-3">6.4</span> Declaring multiple hops in the file name</h3>
<div class="outline-text-3" id="text-6-4">
<p>
TRAMP 文件名语法可以适应多个代理的  ad-hoc 规范，而无需使用  tramp-default-proxies-alist 配置设置（请参阅多跳）。
</p>

<p>
使用与远程主机规范相同的语法减去文件名部分来指定每个代理。每个跃点用 “|” 分隔。将起始主机、代理、目标远程主机名和文件名串起来。例如，通过代理 'bird@bastion' 到 'you@remotehost' 上的远程文件：
</p>
<pre class="example">
C-x C-f /ssh:bird@bastion|ssh:you@remotehost:/path RET
</pre>

<p>
每个涉及的方法必须是内联方法（请参阅内联方法）。
</p>

<p>
代理可以采用％ h 或％ u 的模式。
</p>

<p>
TRAMP 动态地将临时定义添加到  tramp-default-proxies-alist，并且可以在该  Emacs 会话期间重用。然后，对同一远程主机的后续  TRAMP 连接可以使用快捷方式：'/ssh:you@remotehost:/path'。
</p>

<ul class="org-ul">
<li><p>
用户选项：tramp-save-ad-hoc-proxies
</p>

<p>
要在未来的  Emacs 会话中自动保存在  tramp-default-proxies-alist 中的临时定义，请将  tramp-save-ad-hoc-proxies 设置为  non-nil。
</p>
<div class="org-src-container">
<pre class="src src-elisp">(customize-set-variable 'tramp-save-ad-hoc-proxies t)
</pre>
</div></li>
</ul>

<p>
Ad-hoc 代理可以采用  tramp-default-proxies-alist 中的模式％ h 或％ u。以下文件名扩展为主机  remotehost 上的  root 用户，从主机  remotehost 上的  ssh 会话开始：'/ssh:%h|su:remotehost:'。
</p>

<p>
另一方面，如果最后一个未指定主机名，则重用前一跃点的主机名。因此，以下文件名等效于前面的示例：'ssh:remotehost|su::'。
</p>
</div>
</div>

<div id="outline-container-org0a64435" class="outline-3">
<h3 id="org0a64435"><span class="section-number-3">6.5</span> Integration with other Emacs packages</h3>
<div class="outline-text-3" id="text-6-5">
<p>
TRAMP 支持在远程主机上启动新的运行进程以发现远程文件名。远程主机上的  Emacs 软件包无需对  TRAMP 的使用进行特定修改。
</p>

<p>
这种类型的集成不适用于  ftp 方法，并且不支持  start-file-process 中指定的  pty 关联。
</p>

<p>
当变量  default-directory 是远程时，process-file 和  start-file-process 在远程主机上工作：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">let</span> ((default-directory <span style="color: #ff4ea3;">"/ssh:remote.host:"</span>))
  (start-file-process <span style="color: #ff4ea3;">"grep"</span> (get-buffer-create <span style="color: #ff4ea3;">"*grep*"</span>)
                      <span style="color: #ff4ea3;">"/bin/sh"</span> <span style="color: #ff4ea3;">"-c"</span> <span style="color: #ff4ea3;">"grep -e tramp *"</span>))
</pre>
</div>

<p>
远程进程不适用于  GVFS（请参阅基于  GVFS 的方法），因为远程文件系统安装在本地主机上，而  TRAMP 只是通过更改  default-directory 进行访问。
</p>

<p>
在远程文件或目录缓冲区中执行命令时，TRAMP 启动远程进程。截至目前，这些软件包已经集成到  TRAMP 中：compile.el（诸如  compile 和  grep 之类的命令）和  gud.el（gdb 或  perldb）。
</p>

<p>
要使  TRAMP 在远程上找到命令，TRAMP 必须可以通过在第一次连接时设置的默认搜索路径访问它。或者，使用绝对路径或扩展  tramp-remote-path（请参阅远程程序）：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'tramp-remote-path <span style="color: #ff4ea3;">"~/bin"</span>)
(add-to-list 'tramp-remote-path <span style="color: #ff4ea3;">"/appli/pub/bin"</span>)
</pre>
</div>

<p>
自定义用户选项  tramp-remote-process-environment 以适应远程主机的远程程序环境。tramp-remote-process-environment 是一个类似于  process-environment 的字符串列表，其中每个元素都是 'ENVVARNAME=VALUE' 形式的字符串。
</p>

<p>
为避免与通过本地配置文件（例如~/.profile）设置的本地主机环境变量发生冲突，请使用 “ENVVARNAME=” 为远程环境取消设置它们。
</p>

<p>
使用  add-to-list 添加条目：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'tramp-remote-process-environment <span style="color: #ff4ea3;">"JAVA_HOME=/opt/java"</span>)
</pre>
</div>

<p>
在受限远程主机上修改或删除  tramp-remote-process-environment 列表中已有的值可能不可行。例如，某些系统管理员不允许更改  HISTORY 环境变量。要在使用  TRAMP 时适应此类限制，请通过本地. emacs 文件中的以下代码修复  tramp-remote-process-environment：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">let</span> ((process-environment tramp-remote-process-environment))
  (setenv <span style="color: #ff4ea3;">"HISTORY"</span> nil)
  (<span style="color: #a1db00;">setq</span> tramp-remote-process-environment process-environment))
</pre>
</div>

<p>
设置  ENV 环境变量指示一些  shell 读取初始化文件。默认情况下，TRAMP 已禁用此功能。可以通过求值来覆盖此行为
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">let</span> ((process-environment tramp-remote-process-environment))
  (setenv <span style="color: #ff4ea3;">"ENV"</span> <span style="color: #ff4ea3;">"$HOME/.profile"</span>)
  (<span style="color: #a1db00;">setq</span> tramp-remote-process-environment process-environment))
</pre>
</div>

<p>
除了  tramp-remote-process-environment 之外，您还可以通过  let-binding process-environment 为各个远程进程调用设置环境变量。TRAMP 应用任何不存在于  process-environment 的全局默认值中的条目（如果它们发生冲突，则覆盖  tramp-remote-process-environment 设置）。例如：
#+BEGIN_SRC elisp
(let ((process-environment (cons "HGPLAIN=1" process-environment)))
(process-file …))
</p>

<p>
无论要调用的进程是本地还是远程，以这种方式进行绑定都是有效的，因为  TRAMP 只会添加  HGPLAIN 设置，而本地进程会将进程环境的整个值与  HGPLAIN 的新值一起使用。
</p>

<p>
为了集成其他  Emacs 软件包以便  TRAMP 可以远程执行，请提交错误报告。请参阅错误报告。
</p>
</div>

<div id="outline-container-orgc36cc89" class="outline-4">
<h4 id="orgc36cc89"><span class="section-number-4">6.5.1</span> Running remote programs that create local X11 windows</h4>
<div class="outline-text-4" id="text-6-5-1">
<p>
要允许远程程序在本地主机上创建  X11 窗口，请在本地. emacs 文件中为远程主机设置  DISPLAY 环境变量，如下所示：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'tramp-remote-process-environment
             (format <span style="color: #ff4ea3;">"DISPLAY=%s"</span> (getenv <span style="color: #ff4ea3;">"DISPLAY"</span>)))
</pre>
</div>
<p>
(getenv "DISPLAY") 应返回本地主机的可识别名称，以便远程主机可以重定向  X11 窗口交互。 如果由于某种原因无法查询可识别的名称，则用硬编码的固定名称替换（getenv “DISPLAY”）。 请注意，此处使用 <code>:0</code> 表示  X11 显示名称将无法正常工作。
</p>

<p>
另一种方法是在本地主机上的~/.ssh/config 中指定  ForwardX11 yes 或  ForwardX11Trusted yes。
</p>
</div>
</div>

<div id="outline-container-org5c5dc54" class="outline-4">
<h4 id="org5c5dc54"><span class="section-number-4">6.5.2</span> Running shell on a remote host</h4>
<div class="outline-text-4" id="text-6-5-2">
<p>
在具有不同操作系统的两台主机（例如 'windows-nt' 和 'gnu /linux'）之间使用  TRAMP 时，将  explicit-shell-file-name 设置为适当的  shell 名称。 此选项可确保远程  shell 程序的正确名称。
</p>

<p>
当  explicit-shell-file-name 等于  nil 时，以交互方式调用  shell 将提示输入  shell 名称。
</p>

<p>
从  Emacs 26 开始，您可以使用连接局部变量为不同的远程主机设置  explicit-shell-file-name 的不同值。
</p>

<div class="org-src-container">
<pre class="src src-elisp">(connection-local-set-profile-variables
  'remote-bash
  '((explicit-shell-file-name . <span style="color: #ff4ea3;">"/bin/bash"</span>)
    (explicit-bash-args . (<span style="color: #ff4ea3;">"-i"</span>))))

(connection-local-set-profile-variables
  'remote-ksh
  '((explicit-shell-file-name . <span style="color: #ff4ea3;">"/bin/ksh"</span>)
    (explicit-ksh-args . (<span style="color: #ff4ea3;">"-i"</span>))))

(connection-local-set-profiles
  '(<span style="color: #d18aff;">:application</span> tramp <span style="color: #d18aff;">:protocol</span> <span style="color: #ff4ea3;">"ssh"</span> <span style="color: #d18aff;">:machine</span> <span style="color: #ff4ea3;">"localhost"</span>)
  'remote-bash)

(connection-local-set-profiles
  `(<span style="color: #d18aff;">:application</span> tramp <span style="color: #d18aff;">:protocol</span> <span style="color: #ff4ea3;">"sudo"</span>
    <span style="color: #d18aff;">:user</span> <span style="color: #ff4ea3;">"root"</span> <span style="color: #d18aff;">:machine</span> ,(system-name))
  'remote-ksh)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4b0acb" class="outline-4">
<h4 id="orgd4b0acb"><span class="section-number-4">6.5.3</span> Running shell-command on a remote host</h4>
<div class="outline-text-4" id="text-6-5-3">
<p>
shell-command 在远程主机上同步或异步执行命令，并在本地主机的缓冲区中显示输出。 例：
</p>
<pre class="example">
C-x C-f /sudo:: RET
M-&amp; tail -f /var/log/syslog.log RET
</pre>

<p>
tail 命令连续输出到本地缓冲区， <code>*Async Shell Command*</code>
</p>

<p>
<code>M-x auto-revert-tail-mode RET</code> 运行类似，显示连续输出。
</p>
</div>
</div>

<div id="outline-container-org08a0065" class="outline-4">
<h4 id="org08a0065"><span class="section-number-4">6.5.4</span> Running eshell on a remote host</h4>
<div class="outline-text-4" id="text-6-5-4">
<p>
TRAMP 已集成到  eshell.el 中，可在命令提示符下在远程主机上启用交互式  eshell 会话。必须将模块  em-tramp 添加到  eshell-modules-list。 这是在远程主机上打开  M-x eshell RET 后的示例交互：
</p>
<pre class="example">
~ $ cd /sudo::/etc RET
/sudo:root@host:/etc $ hostname RET
host
/sudo:root@host:/etc $ id RET
uid=0(root) gid=0(root) groups=0(root)
/sudo:root@host:/etc $ find-file shadow RET
#&lt;buffer shadow&gt;
/sudo:root@host:/etc $
</pre>
<p>
eshell 添加了自定义  su 和  sudo 命令，可以为 <b>eshell</b> 缓冲区正确设置默认目录。TRAMP 使用此目录的条目静默更新  tramp-default-proxies-alist（请参阅多跳）：
</p>

<pre class="example">
~ $ cd /ssh:user@remotehost:/etc RET
/ssh:user@remotehost:/etc $ find-file shadow RET
File is not readable: /ssh:user@remotehost:/etc/shadow
/ssh:user@remotehost:/etc $ sudo find-file shadow RET
#&lt;buffer shadow&gt;

/ssh:user@remotehost:/etc $ su - RET
/su:root@remotehost:/root $ id RET
uid=0(root) gid=0(root) groups=0(root)
/su:root@remotehost:/root $

</pre>
</div>
</div>
