content/emacs/modes/tramp-mode.org
*** Running a debugger on a remote host
    gud.el 为符号调试器提供统一接口，TRAMP 可以通过使用远程文件名调用 gdb 来在远程主机上运行调试：
    #+BEGIN_EXAMPLE
M-x gdb RET
Run gdb (like this): gdb -i=mi /ssh:host:~/myprog RET
    #+END_EXAMPLE

    由于远程 gdb 和 gdb-inferior 进程不属于远程主机上的同一进程组，因此会出现警告，可以忽略：

    #+BEGIN_EXAMPLE
&"warning: GDB: Failed to set controlling terminal: Operation not permitted\n"
    #+END_EXAMPLE

    因此，要调试的进程的 I/O 将受到限制。

    相对文件名基于远程默认目录。当 myprog.pl 存在于 =/ssh:host:/home/user= 中时，有效的调用包括：
    #+BEGIN_EXAMPLE
M-x perldb RET
Run perldb (like this): perl -d myprog.pl RET
    #+END_EXAMPLE

    只有远程文件名的本地部分，例如 =perl -d /home/user/myprog.pl= ，是不可能的。

    要调试的程序的参数必须是字面的，可以采用相对或绝对路径，但不能采用远程路径。

*** Running remote processes on MS Windows hosts
    winexe 在远程 MS Windows 主机上运行进程，TRAMP 可以将其用于 process-file 和 start-file-process。

    tramp-smb-winexe-program 指定本地 winexe 命令。从 TRAMP 触发运行的进程需要远程主机上的 Powershell V2.0。

    必须正确设置 explicit-shell-file-name 和 explicit-*-args，以便 M-x shell RET 可以在 MS Windows 主机上打开正确的远程 shell。要打开 cmd，请按如下所示进行设置：
    #+BEGIN_SRC elisp
(setq explicit-shell-file-name "cmd"
explicit-cmd-args '("/q"))
    #+END_SRC

    要将 PowerShell 作为远程 shell 打开，请使用以下命令：
    #+BEGIN_SRC elisp
(setq explicit-shell-file-name "powershell"
explicit-powershell-args '("-file" "-"))
    #+END_SRC

** Cleanup remote connections
   TRAMP 提供了几种刷新远程连接的方法。

   + Command: tramp-cleanup-connection vec

   此命令刷新所有与连接相关的对象。vec 是远程连接的内部表示。 以交互方式调用时，此命令会列出迷你缓冲区中的活动远程连接。 每个连接的格式为 =/method:user@host:= 。 刷新远程连接还会清除密码缓存（请参阅密码处理），文件缓存，连接缓存（请参阅连接缓存）和连接缓冲区。

   + Command: tramp-cleanup-this-connection

   仅刷新当前缓冲区的远程连接对象，与 tramp-cleanup-connection 中的相同。

   + Command: tramp-cleanup-all-connections

   刷新所有活动的远程连接对象，与 tramp-cleanup-connection 中的相同。

   + Command: tramp-cleanup-all-buffers

   就像 tramp-cleanup-all-connections 一样，除了杀死与该远程连接相关的缓冲区之外，还清除所有远程连接。

** Archive file names
   TRAMP 还提供对文件存档内文件的透明访问。这仅适用于已为 GNOME 桌面（GVFS），基于 GVFS 的方法安装虚拟文件系统的计算机。在内部，文件存档通过 GVFS archive 方法安装。

   文件存档是 /path/to/dir/file.EXT 的常规文件。扩展名 “.EXT” 标识文件存档的类型。文件存档中的文件（称为存档文件名）的名称为 /path/to/dir/file.EXT/dir/file。

   大多数（elisp）魔术文件名操作都是针对归档文件名实现的，不同的是写入文件归档的所有操作，以及与相关处理的操作。因此，类似以下功能
   #+BEGIN_SRC elisp
(copy-file "/path/to/dir/file.tar/dir/file" "/somewhere/else")
   #+END_SRC
   开箱即用。对于文件名完成以及诸如 dired 或 ediff 之类的库也是如此，它们也接受存档文件名。

   文件存档由文件扩展名 “.EXT” 标识。由于 GVFS 在内部使用库 libarchive（3），因此该库接受的所有后缀也适用于归档文件名。接受的后缀列在常量 tramp-archive-suffix 中。它们是：
   + ‘.7z’ — 7-Zip archives
   + ‘.apk’ — Android package kits
   + ‘.ar’ — UNIX archiver formats
   + ‘.cab’, ‘.CAB’ — Microsoft Windows cabinets
   + ‘.cpio’ — CPIO archives
   + ‘.deb’ — Debian packages
   + ‘.depot’ — HP-UX SD depots
   + ‘.exe’ — Self extracting Microsoft Windows EXE files
   + ‘.iso’ — ISO 9660 images
   + ‘.jar’ — Java archives
   + ‘.lzh’, ‘.LZH’ — Microsoft Windows compressed LHA archives
   + ‘.msu’, ‘.MSU’ — Microsoft Windows Update packages
   + ‘.mtree’ — BSD mtree format
   + ‘.odb’, ‘.odf’, ‘.odg’, ‘.odp’, ‘.ods’, ‘.odt’ — OpenDocument formats
   + ‘.pax’ — Posix archives
   + ‘.rar’ — RAR archives
   + ‘.rpm’ — Red Hat packages
   + ‘.shar’ — Shell archives
   + ‘.tar’, ‘.tbz’, ‘.tgz’, ‘.tlz’, ‘.txz’ — (Compressed) tape archives
   + ‘.warc’ — Web archives
   + ‘.xar’ — macOS XAR archives
   + ‘.xpi’ — XPInstall Mozilla addons
   + ‘.xps’ — Open XML Paper Specification (OpenXPS) documents
   + ‘.zip’, ‘.ZIP’ — ZIP archives

   文件存档也可以压缩，由附加的压缩后缀标识。有效的压缩后缀列在常量 tramp-archive-compression-suffix 中。它们是 ‘.bz2’, ‘.gz’, ‘.lrz’, ‘.lz’, ‘.lz4’, ‘.lzma’, ‘.lzo’, ‘.uu’, ‘.xz’ and ‘.Z’。有效的归档文件名是 /path/to/dir/file.tar.gz/dir/file。甚至可以连续使用几个后缀，例如 /path/to/dir/file.tar.gz.uu/dir/file。

   存档文件名可以是远程文件名，如 =/ftp:anonymous@ftp.gnu.org:/gnu/tramp/tramp-2.3.2.tar.gz/INSTALL= 。由于所有文件操作都在内部映射到 GVFS 操作，因此 tramp-gvfs 支持的远程文件名执行得更好，因为不必首先下载文件存档的本地副本。例如，'/sftp：user @ host：...' 比类似的 '/sftp:user@host:...' 表现更好。有关 tramp-gvfs 支持的方法名称的完整列表，请参阅常量 tramp-archive-all-gvfs-methods。

   如果启用了 url-handler-mode，则可以通过 URL 访问归档，例如 =https://ftp.gnu.org/gnu/tramp/tramp-2.3.2.tar.gz/INSTALL= 。这允许复杂的文件操作:
   #+BEGIN_SRC elisp
(progn
(url-handler-mode 1)
(ediff-directories
 "https://ftp.gnu.org/gnu/tramp/tramp-2.3.1.tar.gz/tramp-2.3.1"
 "https://ftp.gnu.org/gnu/tramp/tramp-2.3.2.tar.gz/tramp-2.3.2" ""))
   #+END_SRC
   甚至可以访问文件存档中的文件存档：
   #+BEGIN_SRC elisp
(progn
(url-handler-mode 1)
(find-file
 "http://ftp.debian.org/debian/pool/main/c/coreutils/coreutils_8.28-1_amd64.deb/control.tar.gz/control"))
   #+END_SRC
