emacs/modes/tramp-mode.html


<div id="outline-container-org138ecfc" class="outline-4">
<h4 id="org138ecfc"><span class="section-number-4">6.5.5</span> Running a debugger on a remote host</h4>
<div class="outline-text-4" id="text-6-5-5">
<p>
gud.el 为符号调试器提供统一接口，TRAMP 可以通过使用远程文件名调用  gdb 来在远程主机上运行调试：
</p>
<pre class="example">
M-x gdb RET
Run gdb (like this): gdb -i=mi /ssh:host:~/myprog RET
</pre>

<p>
由于远程  gdb 和  gdb-inferior 进程不属于远程主机上的同一进程组，因此会出现警告，可以忽略：
</p>

<pre class="example">
&amp;"warning: GDB: Failed to set controlling terminal: Operation not permitted\n"
</pre>

<p>
因此，要调试的进程的  I/O 将受到限制。
</p>

<p>
相对文件名基于远程默认目录。当  myprog.pl 存在于 <code>/ssh:host:/home/user</code> 中时，有效的调用包括：
</p>
<pre class="example">
M-x perldb RET
Run perldb (like this): perl -d myprog.pl RET
</pre>

<p>
只有远程文件名的本地部分，例如 <code>perl -d /home/user/myprog.pl</code> ，是不可能的。
</p>

<p>
要调试的程序的参数必须是字面的，可以采用相对或绝对路径，但不能采用远程路径。
</p>
</div>
</div>

<div id="outline-container-orgb2427db" class="outline-4">
<h4 id="orgb2427db"><span class="section-number-4">6.5.6</span> Running remote processes on MS Windows hosts</h4>
<div class="outline-text-4" id="text-6-5-6">
<p>
winexe 在远程  MS Windows 主机上运行进程，TRAMP 可以将其用于  process-file 和  start-file-process。
</p>

<p>
tramp-smb-winexe-program 指定本地  winexe 命令。从  TRAMP 触发运行的进程需要远程主机上的  Powershell V2.0。
</p>

<p>
必须正确设置  explicit-shell-file-name 和  explicit-*-args，以便  M-x shell RET 可以在  MS Windows 主机上打开正确的远程  shell。要打开  cmd，请按如下所示进行设置：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> explicit-shell-file-name <span style="color: #ff4ea3;">"cmd"</span>
      explicit-cmd-args '(<span style="color: #ff4ea3;">"/q"</span>))
</pre>
</div>

<p>
要将  PowerShell 作为远程  shell 打开，请使用以下命令：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> explicit-shell-file-name <span style="color: #ff4ea3;">"powershell"</span>
      explicit-powershell-args '(<span style="color: #ff4ea3;">"-file"</span> <span style="color: #ff4ea3;">"-"</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgea160ea" class="outline-3">
<h3 id="orgea160ea"><span class="section-number-3">6.6</span> Cleanup remote connections</h3>
<div class="outline-text-3" id="text-6-6">
<p>
TRAMP 提供了几种刷新远程连接的方法。
</p>

<ul class="org-ul">
<li><p>
Command: tramp-cleanup-connection vec
</p>

<p>
此命令刷新所有与连接相关的对象。vec 是远程连接的内部表示。 以交互方式调用时，此命令会列出迷你缓冲区中的活动远程连接。 每个连接的格式为 <code>/method:user@host:</code> 。 刷新远程连接还会清除密码缓存（请参阅密码处理），文件缓存，连接缓存（请参阅连接缓存）和连接缓冲区。
</p></li>

<li><p>
Command: tramp-cleanup-this-connection
</p>

<p>
仅刷新当前缓冲区的远程连接对象，与  tramp-cleanup-connection 中的相同。
</p></li>

<li><p>
Command: tramp-cleanup-all-connections
</p>

<p>
刷新所有活动的远程连接对象，与  tramp-cleanup-connection 中的相同。
</p></li>

<li><p>
Command: tramp-cleanup-all-buffers
</p>

<p>
就像  tramp-cleanup-all-connections 一样，除了杀死与该远程连接相关的缓冲区之外，还清除所有远程连接。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org23dbddb" class="outline-3">
<h3 id="org23dbddb"><span class="section-number-3">6.7</span> Archive file names</h3>
<div class="outline-text-3" id="text-6-7">
<p>
TRAMP 还提供对文件存档内文件的透明访问。这仅适用于已为  GNOME 桌面（GVFS），基于  GVFS 的方法安装虚拟文件系统的计算机。在内部，文件存档通过  GVFS archive 方法安装。
</p>

<p>
文件存档是 /path/to/dir/file.EXT 的常规文件。扩展名 “.EXT” 标识文件存档的类型。文件存档中的文件（称为存档文件名）的名称为 /path/to/dir/file.EXT/dir/file。
</p>

<p>
大多数（elisp）魔术文件名操作都是针对归档文件名实现的，不同的是写入文件归档的所有操作，以及与相关处理的操作。因此，类似以下功能
</p>
<div class="org-src-container">
<pre class="src src-elisp">(copy-file <span style="color: #ff4ea3;">"/path/to/dir/file.tar/dir/file"</span> <span style="color: #ff4ea3;">"/somewhere/else"</span>)
</pre>
</div>
<p>
开箱即用。对于文件名完成以及诸如  dired 或  ediff 之类的库也是如此，它们也接受存档文件名。
</p>

<p>
文件存档由文件扩展名 “.EXT” 标识。由于  GVFS 在内部使用库  libarchive（3），因此该库接受的所有后缀也适用于归档文件名。接受的后缀列在常量  tramp-archive-suffix 中。它们是：
</p>
<ul class="org-ul">
<li>‘.7z’ — 7-Zip archives</li>
<li>‘.apk’ — Android package kits</li>
<li>‘.ar’ — UNIX archiver formats</li>
<li>‘.cab’, ‘.CAB’ — Microsoft Windows cabinets</li>
<li>‘.cpio’ — CPIO archives</li>
<li>‘.deb’ — Debian packages</li>
<li>‘.depot’ — HP-UX SD depots</li>
<li>‘.exe’ — Self extracting Microsoft Windows EXE files</li>
<li>‘.iso’ — ISO 9660 images</li>
<li>‘.jar’ — Java archives</li>
<li>‘.lzh’, ‘.LZH’ — Microsoft Windows compressed LHA archives</li>
<li>‘.msu’, ‘.MSU’ — Microsoft Windows Update packages</li>
<li>‘.mtree’ — BSD mtree format</li>
<li>‘.odb’, ‘.odf’, ‘.odg’, ‘.odp’, ‘.ods’, ‘.odt’ — OpenDocument formats</li>
<li>‘.pax’ — Posix archives</li>
<li>‘.rar’ — RAR archives</li>
<li>‘.rpm’ — Red Hat packages</li>
<li>‘.shar’ — Shell archives</li>
<li>‘.tar’, ‘.tbz’, ‘.tgz’, ‘.tlz’, ‘.txz’ — (Compressed) tape archives</li>
<li>‘.warc’ — Web archives</li>
<li>‘.xar’ — macOS XAR archives</li>
<li>‘.xpi’ — XPInstall Mozilla addons</li>
<li>‘.xps’ — Open XML Paper Specification (OpenXPS) documents</li>
<li>‘.zip’, ‘.ZIP’ — ZIP archives</li>
</ul>

<p>
文件存档也可以压缩，由附加的压缩后缀标识。有效的压缩后缀列在常量  tramp-archive-compression-suffix 中。它们是 ‘.bz2’, ‘.gz’, ‘.lrz’, ‘.lz’, ‘.lz4’, ‘.lzma’, ‘.lzo’, ‘.uu’, ‘.xz’ and ‘.Z’。有效的归档文件名是 /path/to/dir/file.tar.gz/dir/file。甚至可以连续使用几个后缀，例如 /path/to/dir/file.tar.gz.uu/dir/file。
</p>

<p>
存档文件名可以是远程文件名，如 <code>/ftp:anonymous@ftp.gnu.org:/gnu/tramp/tramp-2.3.2.tar.gz/INSTALL</code> 。由于所有文件操作都在内部映射到  GVFS 操作，因此  tramp-gvfs 支持的远程文件名执行得更好，因为不必首先下载文件存档的本地副本。例如，'/sftp：user @ host：&#x2026;' 比类似的 '/sftp:user@host:&#x2026;' 表现更好。有关  tramp-gvfs 支持的方法名称的完整列表，请参阅常量  tramp-archive-all-gvfs-methods。
</p>

<p>
如果启用了  url-handler-mode，则可以通过  URL 访问归档，例如 <code>https://ftp.gnu.org/gnu/tramp/tramp-2.3.2.tar.gz/INSTALL</code> 。这允许复杂的文件操作:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">progn</span>
  (url-handler-mode 1)
  (ediff-directories
   <span style="color: #ff4ea3;">"https://ftp.gnu.org/gnu/tramp/tramp-2.3.1.tar.gz/tramp-2.3.1"</span>
   <span style="color: #ff4ea3;">"https://ftp.gnu.org/gnu/tramp/tramp-2.3.2.tar.gz/tramp-2.3.2"</span> <span style="color: #ff4ea3;">""</span>))
</pre>
</div>
<p>
甚至可以访问文件存档中的文件存档：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">progn</span>
  (url-handler-mode 1)
  (find-file
   <span style="color: #ff4ea3;">"http://ftp.debian.org/debian/pool/main/c/coreutils/coreutils_8.28-1_amd64.deb/control.tar.gz/control"</span>))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-05 四 17:00</p>
<p class="validation"></p>
</div>
</body>
</html>
